In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("titanic.csv")
df.head(3)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,NaN,0,0,STON/O2. 3101282,7.9250,NaN,S

In [3]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Gender           0
Age            180
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [4]:
df["Age"].fillna(df["Age"].mean(),inplace=True)
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Gender           0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [5]:
movie_dict = {"Movies":["Interstellar","Avengers","Dhoom","Interstellar"],
"Genre":["fiction","Fiction","Comedy","fiction"],
"Actors":["American","French","Indian","American"]}
movie_dict

{'Movies': ['Interstellar', 'Avengers', 'Dhoom', 'Interstellar'],
 'Genre': ['fiction', 'Fiction', 'Comedy', 'fiction'],
 'Actors': ['American', 'French', 'Indian', 'American']}

In [6]:
index_labels = ["a","b","c","d"]
df = pd.DataFrame(movie_dict , index=index_labels)
df

         Movies    Genre    Actors
a  Interstellar  fiction  American
b      Avengers  Fiction    French
c         Dhoom   Comedy    Indian
d  Interstellar  fiction  American

In [7]:
df

         Movies    Genre    Actors
a  Interstellar  fiction  American
b      Avengers  Fiction    French
c         Dhoom   Comedy    Indian
d  Interstellar  fiction  American

In [8]:
df.head(3)

         Movies    Genre    Actors
a  Interstellar  fiction  American
b      Avengers  Fiction    French
c         Dhoom   Comedy    Indian

In [9]:
df = pd.read_csv("titanic.csv")
df.head(3)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,NaN,0,0,STON/O2. 3101282,7.9250,NaN,S

In [10]:
df.loc[:1 , ["Name","Age","Gender"]]

                                                Name   Age  Gender
0                            Braund, Mr. Owen Harris  22.0    male
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0  female

In [11]:
df.head(3)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,NaN,0,0,STON/O2. 3101282,7.9250,NaN,S

In [12]:
df.loc[[0,1,3,5,7,9,11] , ["Name","Age"]]

                                                 Name   Age
0                             Braund, Mr. Owen Harris  22.0
1   Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
3        Futrelle, Mrs. Jacques Heath (Lily May Peel)   NaN
5                                    Moran, Mr. James   NaN
7                      Palsson, Master. Gosta Leonard   2.0
9                 Nasser, Mrs. Nicholas (Adele Achem)  14.0
11                           Bonnell, Miss. Elizabeth  58.0

In [13]:
df.head(3)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,NaN,0,0,STON/O2. 3101282,7.9250,NaN,S

In [14]:
df.isna()

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,True,False,False,False,False,True,False
3,False,False,False,False,False,True,False,False,False,False,False,False
4,False,False,False,False,False,True,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,True,False
887,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,False,False,True,False,False,False,False,True,False
889,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,True,False

In [15]:
df.isna().sum().to_dict()

{'PassengerId': 0,
 'Survived': 0,
 'Pclass': 0,
 'Name': 0,
 'Gender': 0,
 'Age': 180,
 'SibSp': 0,
 'Parch': 0,
 'Ticket': 0,
 'Fare': 0,
 'Cabin': 687,
 'Embarked': 2}

In [16]:
df = pd.read_csv("titanic.csv")
df.head(3)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,NaN,0,0,STON/O2. 3101282,7.9250,NaN,S

In [17]:
df.isna().sum().to_dict()

{'PassengerId': 0,
 'Survived': 0,
 'Pclass': 0,
 'Name': 0,
 'Gender': 0,
 'Age': 180,
 'SibSp': 0,
 'Parch': 0,
 'Ticket': 0,
 'Fare': 0,
 'Cabin': 687,
 'Embarked': 2}

In [18]:
df.isnull().sum().to_dict()

{'PassengerId': 0,
 'Survived': 0,
 'Pclass': 0,
 'Name': 0,
 'Gender': 0,
 'Age': 180,
 'SibSp': 0,
 'Parch': 0,
 'Ticket': 0,
 'Fare': 0,
 'Cabin': 687,
 'Embarked': 2}

In [19]:
df.dropna()

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
21,22,1,2,"Beesley, Mr. Lawrence",male,34.0,0,0,248698,13.0000,D56,S
...,...,...,...,...,...,...,...,...,...,...,...,...
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

In [20]:
df.isna().sum().to_dict()

{'PassengerId': 0,
 'Survived': 0,
 'Pclass': 0,
 'Name': 0,
 'Gender': 0,
 'Age': 180,
 'SibSp': 0,
 'Parch': 0,
 'Ticket': 0,
 'Fare': 0,
 'Cabin': 687,
 'Embarked': 2}

In [21]:
df.dropna()

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
21,22,1,2,"Beesley, Mr. Lawrence",male,34.0,0,0,248698,13.0000,D56,S
...,...,...,...,...,...,...,...,...,...,...,...,...
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

In [23]:
df.isna().sum().to_dict()

{'PassengerId': 0,
 'Survived': 0,
 'Pclass': 0,
 'Name': 0,
 'Gender': 0,
 'Age': 180,
 'SibSp': 0,
 'Parch': 0,
 'Ticket': 0,
 'Fare': 0,
 'Cabin': 687,
 'Embarked': 2}

In [24]:
df["Age"].fillna(44444,inplace=True)
df.isna().sum().to_dict()

{'PassengerId': 0,
 'Survived': 0,
 'Pclass': 0,
 'Name': 0,
 'Gender': 0,
 'Age': 0,
 'SibSp': 0,
 'Parch': 0,
 'Ticket': 0,
 'Fare': 0,
 'Cabin': 687,
 'Embarked': 2}

In [25]:
df = pd.read_csv("titanic.csv")
df.head(3)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,NaN,0,0,STON/O2. 3101282,7.9250,NaN,S

In [26]:
df.isna().sum().to_dict()

{'PassengerId': 0,
 'Survived': 0,
 'Pclass': 0,
 'Name': 0,
 'Gender': 0,
 'Age': 180,
 'SibSp': 0,
 'Parch': 0,
 'Ticket': 0,
 'Fare': 0,
 'Cabin': 687,
 'Embarked': 2}

In [27]:
df["Age"].fillna(df["Age"].median(),inplace=True)
df.isna().sum().to_dict()

{'PassengerId': 0,
 'Survived': 0,
 'Pclass': 0,
 'Name': 0,
 'Gender': 0,
 'Age': 0,
 'SibSp': 0,
 'Parch': 0,
 'Ticket': 0,
 'Fare': 0,
 'Cabin': 687,
 'Embarked': 2}

In [29]:
df = pd.read_csv("titanic.csv")
df.head(3)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,NaN,0,0,STON/O2. 3101282,7.9250,NaN,S

In [30]:
df.dropna()

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
21,22,1,2,"Beesley, Mr. Lawrence",male,34.0,0,0,248698,13.0000,D56,S
...,...,...,...,...,...,...,...,...,...,...,...,...
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

In [31]:
df = pd.read_csv("titanic.csv")
df.head(3)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,NaN,0,0,STON/O2. 3101282,7.9250,NaN,S

In [32]:
df.isna().sum().to_dict()

{'PassengerId': 0,
 'Survived': 0,
 'Pclass': 0,
 'Name': 0,
 'Gender': 0,
 'Age': 180,
 'SibSp': 0,
 'Parch': 0,
 'Ticket': 0,
 'Fare': 0,
 'Cabin': 687,
 'Embarked': 2}

In [33]:
print("Nan Values present in Age feature at indexes :\n",df["Age"].isna().to_numpy().nonzero())

Nan Values present in Age feature at indexes :
 (array([  2,   3,   4,   5,  17,  19,  26,  28,  29,  31,  32,  36,  42,
        45,  46,  47,  48,  55,  64,  65,  76,  77,  82,  87,  95, 101,
       107, 109, 121, 126, 128, 140, 154, 158, 159, 166, 168, 176, 180,
       181, 185, 186, 196, 198, 201, 214, 223, 229, 235, 240, 241, 250,
       256, 260, 264, 270, 274, 277, 284, 295, 298, 300, 301, 303, 304,
       306, 324, 330, 334, 335, 347, 351, 354, 358, 359, 364, 367, 368,
       375, 384, 388, 409, 410, 411, 413, 415, 420, 425, 428, 431, 444,
       451, 454, 457, 459, 464, 466, 468, 470, 475, 481, 485, 490, 495,
       497, 502, 507, 511, 517, 522, 524, 527, 531, 533, 538, 547, 552,
       557, 560, 563, 564, 568, 573, 578, 584, 589, 593, 596, 598, 601,
       602, 611, 612, 613, 629, 633, 639, 643, 648, 650, 653, 656, 667,
       669, 674, 680, 692, 697, 709, 711, 718, 727, 732, 738, 739, 740,
       760, 766, 768, 773, 776, 778, 783, 790, 792, 793, 815, 825, 826,
       828, 832, 837, 839, 846, 849, 859, 863, 868, 878, 888], dtype=int64),)

In [34]:
print("Nan values present in Age feature at indexes :\n",df["Age"].isna().to_numpy().nonzero())

Nan values present in Age feature at indexes :
 (array([  2,   3,   4,   5,  17,  19,  26,  28,  29,  31,  32,  36,  42,
        45,  46,  47,  48,  55,  64,  65,  76,  77,  82,  87,  95, 101,
       107, 109, 121, 126, 128, 140, 154, 158, 159, 166, 168, 176, 180,
       181, 185, 186, 196, 198, 201, 214, 223, 229, 235, 240, 241, 250,
       256, 260, 264, 270, 274, 277, 284, 295, 298, 300, 301, 303, 304,
       306, 324, 330, 334, 335, 347, 351, 354, 358, 359, 364, 367, 368,
       375, 384, 388, 409, 410, 411, 413, 415, 420, 425, 428, 431, 444,
       451, 454, 457, 459, 464, 466, 468, 470, 475, 481, 485, 490, 495,
       497, 502, 507, 511, 517, 522, 524, 527, 531, 533, 538, 547, 552,
       557, 560, 563, 564, 568, 573, 578, 584, 589, 593, 596, 598, 601,
       602, 611, 612, 613, 629, 633, 639, 643, 648, 650, 653, 656, 667,
       669, 674, 680, 692, 697, 709, 711, 718, 727, 732, 738, 739, 740,
       760, 766, 768, 773, 776, 778, 783, 790, 792, 793, 815, 825, 826,
       828, 832, 837, 839, 846, 849, 859, 863, 868, 878, 888], dtype=int64),)

In [35]:
df = pd.read_csv("titanic.csv")
df.head(3)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,NaN,0,0,STON/O2. 3101282,7.9250,NaN,S

In [36]:
female = df.groupby(df["Gender"]).get_group("female")
female

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,NaN,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,NaN,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [37]:
S = df.groupby(df["Embarked"]).get_group("S")
S

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,NaN,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,NaN,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,NaN,0,0,373450,8.0500,NaN,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
...,...,...,...,...,...,...,...,...,...,...,...,...
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [38]:
df

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,NaN,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,NaN,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,NaN,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [39]:
df = pd.read_csv("diabetes.csv")
df.head(3)

,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,148,50,35,0,33.6,0.627,50,1
1,85,66,29,0,26.6,0.351,31,0
2,183,64,0,0,23.3,0.672,52,1

In [40]:
df.loc[:,["Age","Outcome","BMI","Glucose"]]

     Age  Outcome   BMI  Glucose
0     50        1  33.6      148
1     31        0  26.6       85
2     52        1  23.3      183
3     21        0  28.1      150
4     33        1  43.1      150
..   ...      ...   ...      ...
763   63        0  32.9      101
764   27        0  36.8      122
765   30        0  26.2      121
766   47        1  30.1      126
767   23        0  30.4       93

[768 rows x 4 columns]

In [41]:
df.reindex(["Age","Outcome","BMI"],axis=1)

     Age  Outcome   BMI
0     50        1  33.6
1     31        0  26.6
2     52        1  23.3
3     21        0  28.1
4     33        1  43.1
..   ...      ...   ...
763   63        0  32.9
764   27        0  36.8
765   30        0  26.2
766   47        1  30.1
767   23        0  30.4

[768 rows x 3 columns]

In [42]:
df = pd.read_csv("student.csv")
df

    id         name  class  mark  gender
0    1     John Deo   Four    75  female
1    2     Max Ruin  Three    85    male
2    3       Arnold  Three    55    male
3    4   Krish Star   Four    60  female
4    5    John Mike   Four    60  female
5    6    Alex John   Four    55    male
6    7  My John Rob  Fifth    78    male
7    8       Asruid   Five    85    male
8    9      Tes Qry    Six    78    male
9   10     Big John   Four    55  female
10  11       Ronald    Six    89  female
11  12        Recky    Six    94  female
12  13          Kty  Seven    88  female
13  14         Bigy  Seven    88  female
14  15     Tade Row   Four    88    male
15  16        Gimmy   Four    88    male
16  17        Tumyu    Six    54    male
17  18        Honny   Five    75    male
18  19        Tinny   Nine    18    male
19  20       Jackly   Nine    65  female
20  21   Babby John   Four    69  female
21  22       Reggid  Seven    55  female
22  23        Herod  Eight    79    male
23  24    Tiddy Now  Seven    78    male
24  25     Giff Tow  Seven    88    male
25  26       Crelea  Seven    79    male
26  27     Big Nose  Three    81  female
27  28    Rojj Base  Seven    86  female
28  29  Tess Played  Seven    55    male
29  30    Reppy Red    Six    79  female
30  31  Marry Toeey   Four    88    male
31  32    Binn Rott  Seven    90  female
32  33    Kenn Rein    Six    96  female
33  34     Gain Toe  Seven    69    male
34  35   Rows Noump    Six    88  female

In [43]:
df.loc[35] = [36 , "Pablo" , "Five" , 45 , "Male"]
df

    id         name  class  mark  gender
0    1     John Deo   Four    75  female
1    2     Max Ruin  Three    85    male
2    3       Arnold  Three    55    male
3    4   Krish Star   Four    60  female
4    5    John Mike   Four    60  female
5    6    Alex John   Four    55    male
6    7  My John Rob  Fifth    78    male
7    8       Asruid   Five    85    male
8    9      Tes Qry    Six    78    male
9   10     Big John   Four    55  female
10  11       Ronald    Six    89  female
11  12        Recky    Six    94  female
12  13          Kty  Seven    88  female
13  14         Bigy  Seven    88  female
14  15     Tade Row   Four    88    male
15  16        Gimmy   Four    88    male
16  17        Tumyu    Six    54    male
17  18        Honny   Five    75    male
18  19        Tinny   Nine    18    male
19  20       Jackly   Nine    65  female
20  21   Babby John   Four    69  female
21  22       Reggid  Seven    55  female
22  23        Herod  Eight    79    male
23  24    Tiddy Now  Seven    78    male
24  25     Giff Tow  Seven    88    male
25  26       Crelea  Seven    79    male
26  27     Big Nose  Three    81  female
27  28    Rojj Base  Seven    86  female
28  29  Tess Played  Seven    55    male
29  30    Reppy Red    Six    79  female
30  31  Marry Toeey   Four    88    male
31  32    Binn Rott  Seven    90  female
32  33    Kenn Rein    Six    96  female
33  34     Gain Toe  Seven    69    male
34  35   Rows Noump    Six    88  female
35  36        Pablo   Five    45    Male

In [44]:
df.head(3)

   id      name  class  mark  gender
0   1  John Deo   Four    75  female
1   2  Max Ruin  Three    85    male
2   3    Arnold  Three    55    male

In [46]:
df.drop((df.loc[(df["mark"]<50)]).index)

    id         name  class  mark  gender
0    1     John Deo   Four    75  female
1    2     Max Ruin  Three    85    male
2    3       Arnold  Three    55    male
3    4   Krish Star   Four    60  female
4    5    John Mike   Four    60  female
5    6    Alex John   Four    55    male
6    7  My John Rob  Fifth    78    male
7    8       Asruid   Five    85    male
8    9      Tes Qry    Six    78    male
9   10     Big John   Four    55  female
10  11       Ronald    Six    89  female
11  12        Recky    Six    94  female
12  13          Kty  Seven    88  female
13  14         Bigy  Seven    88  female
14  15     Tade Row   Four    88    male
15  16        Gimmy   Four    88    male
16  17        Tumyu    Six    54    male
17  18        Honny   Five    75    male
19  20       Jackly   Nine    65  female
20  21   Babby John   Four    69  female
21  22       Reggid  Seven    55  female
22  23        Herod  Eight    79    male
23  24    Tiddy Now  Seven    78    male
24  25     Giff Tow  Seven    88    male
25  26       Crelea  Seven    79    male
26  27     Big Nose  Three    81  female
27  28    Rojj Base  Seven    86  female
28  29  Tess Played  Seven    55    male
29  30    Reppy Red    Six    79  female
30  31  Marry Toeey   Four    88    male
31  32    Binn Rott  Seven    90  female
32  33    Kenn Rein    Six    96  female
33  34     Gain Toe  Seven    69    male
34  35   Rows Noump    Six    88  female

In [47]:
df

    id         name  class  mark  gender
0    1     John Deo   Four    75  female
1    2     Max Ruin  Three    85    male
2    3       Arnold  Three    55    male
3    4   Krish Star   Four    60  female
4    5    John Mike   Four    60  female
5    6    Alex John   Four    55    male
6    7  My John Rob  Fifth    78    male
7    8       Asruid   Five    85    male
8    9      Tes Qry    Six    78    male
9   10     Big John   Four    55  female
10  11       Ronald    Six    89  female
11  12        Recky    Six    94  female
12  13          Kty  Seven    88  female
13  14         Bigy  Seven    88  female
14  15     Tade Row   Four    88    male
15  16        Gimmy   Four    88    male
16  17        Tumyu    Six    54    male
17  18        Honny   Five    75    male
18  19        Tinny   Nine    18    male
19  20       Jackly   Nine    65  female
20  21   Babby John   Four    69  female
21  22       Reggid  Seven    55  female
22  23        Herod  Eight    79    male
23  24    Tiddy Now  Seven    78    male
24  25     Giff Tow  Seven    88    male
25  26       Crelea  Seven    79    male
26  27     Big Nose  Three    81  female
27  28    Rojj Base  Seven    86  female
28  29  Tess Played  Seven    55    male
29  30    Reppy Red    Six    79  female
30  31  Marry Toeey   Four    88    male
31  32    Binn Rott  Seven    90  female
32  33    Kenn Rein    Six    96  female
33  34     Gain Toe  Seven    69    male
34  35   Rows Noump    Six    88  female
35  36        Pablo   Five    45    Male

In [48]:
df.iloc[[5],]

   id       name class  mark gender
5   6  Alex John  Four    55   male

In [49]:
df.iloc[:5]

   id        name  class  mark  gender
0   1    John Deo   Four    75  female
1   2    Max Ruin  Three    85    male
2   3      Arnold  Three    55    male
3   4  Krish Star   Four    60  female
4   5   John Mike   Four    60  female

In [50]:
df.iloc[[2]]

   id    name  class  mark gender
2   3  Arnold  Three    55   male

In [51]:
df.head(3)

   id      name  class  mark  gender
0   1  John Deo   Four    75  female
1   2  Max Ruin  Three    85    male
2   3    Arnold  Three    55    male

In [52]:
class1 = {class1 : len(class1) for class1 in df["class"]}
class1

{'Four': 4,
 'Three': 5,
 'Fifth': 5,
 'Five': 4,
 'Six': 3,
 'Seven': 5,
 'Nine': 4,
 'Eight': 5}

In [53]:
class1 = {class1 : len(class1) for class1 in df["name"]}
class1

{'John Deo': 8,
 'Max Ruin': 8,
 'Arnold': 6,
 'Krish Star': 10,
 'John Mike': 9,
 'Alex John': 9,
 'My John Rob': 11,
 'Asruid': 6,
 'Tes Qry': 7,
 'Big John': 8,
 'Ronald': 6,
 'Recky': 5,
 'Kty': 3,
 'Bigy': 4,
 'Tade Row': 8,
 'Gimmy': 5,
 'Tumyu': 5,
 'Honny': 5,
 'Tinny': 5,
 'Jackly': 6,
 'Babby John': 10,
 'Reggid': 6,
 'Herod': 5,
 'Tiddy Now': 9,
 'Giff Tow': 8,
 'Crelea': 6,
 'Big Nose': 8,
 'Rojj Base': 9,
 'Tess Played': 11,
 'Reppy Red': 9,
 'Marry Toeey': 11,
 'Binn Rott': 9,
 'Kenn Rein': 9,
 'Gain Toe': 8,
 'Rows Noump': 10,
 'Pablo': 5}

In [54]:
df["name"] = pd.DataFrame([name.swapcase() for name in df["name"]])
df

    id         name  class  mark  gender
0    1     jOHN dEO   Four    75  female
1    2     mAX rUIN  Three    85    male
2    3       aRNOLD  Three    55    male
3    4   kRISH sTAR   Four    60  female
4    5    jOHN mIKE   Four    60  female
5    6    aLEX jOHN   Four    55    male
6    7  mY jOHN rOB  Fifth    78    male
7    8       aSRUID   Five    85    male
8    9      tES qRY    Six    78    male
9   10     bIG jOHN   Four    55  female
10  11       rONALD    Six    89  female
11  12        rECKY    Six    94  female
12  13          kTY  Seven    88  female
13  14         bIGY  Seven    88  female
14  15     tADE rOW   Four    88    male
15  16        gIMMY   Four    88    male
16  17        tUMYU    Six    54    male
17  18        hONNY   Five    75    male
18  19        tINNY   Nine    18    male
19  20       jACKLY   Nine    65  female
20  21   bABBY jOHN   Four    69  female
21  22       rEGGID  Seven    55  female
22  23        hEROD  Eight    79    male
23  24    tIDDY nOW  Seven    78    male
24  25     gIFF tOW  Seven    88    male
25  26       cRELEA  Seven    79    male
26  27     bIG nOSE  Three    81  female
27  28    rOJJ bASE  Seven    86  female
28  29  tESS pLAYED  Seven    55    male
29  30    rEPPY rED    Six    79  female
30  31  mARRY tOEEY   Four    88    male
31  32    bINN rOTT  Seven    90  female
32  33    kENN rEIN    Six    96  female
33  34     gAIN tOE  Seven    69    male
34  35   rOWS nOUMP    Six    88  female
35  36        pABLO   Five    45    Male

In [55]:
df["gender"] = pd.DataFrame([name.swapcase() for name in df["gender"]])
df

    id         name  class  mark  gender
0    1     jOHN dEO   Four    75  FEMALE
1    2     mAX rUIN  Three    85    MALE
2    3       aRNOLD  Three    55    MALE
3    4   kRISH sTAR   Four    60  FEMALE
4    5    jOHN mIKE   Four    60  FEMALE
5    6    aLEX jOHN   Four    55    MALE
6    7  mY jOHN rOB  Fifth    78    MALE
7    8       aSRUID   Five    85    MALE
8    9      tES qRY    Six    78    MALE
9   10     bIG jOHN   Four    55  FEMALE
10  11       rONALD    Six    89  FEMALE
11  12        rECKY    Six    94  FEMALE
12  13          kTY  Seven    88  FEMALE
13  14         bIGY  Seven    88  FEMALE
14  15     tADE rOW   Four    88    MALE
15  16        gIMMY   Four    88    MALE
16  17        tUMYU    Six    54    MALE
17  18        hONNY   Five    75    MALE
18  19        tINNY   Nine    18    MALE
19  20       jACKLY   Nine    65  FEMALE
20  21   bABBY jOHN   Four    69  FEMALE
21  22       rEGGID  Seven    55  FEMALE
22  23        hEROD  Eight    79    MALE
23  24    tIDDY nOW  Seven    78    MALE
24  25     gIFF tOW  Seven    88    MALE
25  26       cRELEA  Seven    79    MALE
26  27     bIG nOSE  Three    81  FEMALE
27  28    rOJJ bASE  Seven    86  FEMALE
28  29  tESS pLAYED  Seven    55    MALE
29  30    rEPPY rED    Six    79  FEMALE
30  31  mARRY tOEEY   Four    88    MALE
31  32    bINN rOTT  Seven    90  FEMALE
32  33    kENN rEIN    Six    96  FEMALE
33  34     gAIN tOE  Seven    69    MALE
34  35   rOWS nOUMP    Six    88  FEMALE
35  36        pABLO   Five    45    mALE

In [56]:
df["name"] = pd.DataFrame(df["name"].apply(lambda x : x.swapcase()))
df

    id         name  class  mark  gender
0    1     John Deo   Four    75  FEMALE
1    2     Max Ruin  Three    85    MALE
2    3       Arnold  Three    55    MALE
3    4   Krish Star   Four    60  FEMALE
4    5    John Mike   Four    60  FEMALE
5    6    Alex John   Four    55    MALE
6    7  My John Rob  Fifth    78    MALE
7    8       Asruid   Five    85    MALE
8    9      Tes Qry    Six    78    MALE
9   10     Big John   Four    55  FEMALE
10  11       Ronald    Six    89  FEMALE
11  12        Recky    Six    94  FEMALE
12  13          Kty  Seven    88  FEMALE
13  14         Bigy  Seven    88  FEMALE
14  15     Tade Row   Four    88    MALE
15  16        Gimmy   Four    88    MALE
16  17        Tumyu    Six    54    MALE
17  18        Honny   Five    75    MALE
18  19        Tinny   Nine    18    MALE
19  20       Jackly   Nine    65  FEMALE
20  21   Babby John   Four    69  FEMALE
21  22       Reggid  Seven    55  FEMALE
22  23        Herod  Eight    79    MALE
23  24    Tiddy Now  Seven    78    MALE
24  25     Giff Tow  Seven    88    MALE
25  26       Crelea  Seven    79    MALE
26  27     Big Nose  Three    81  FEMALE
27  28    Rojj Base  Seven    86  FEMALE
28  29  Tess Played  Seven    55    MALE
29  30    Reppy Red    Six    79  FEMALE
30  31  Marry Toeey   Four    88    MALE
31  32    Binn Rott  Seven    90  FEMALE
32  33    Kenn Rein    Six    96  FEMALE
33  34     Gain Toe  Seven    69    MALE
34  35   Rows Noump    Six    88  FEMALE
35  36        Pablo   Five    45    mALE

In [57]:
df["gender"] = pd.DataFrame(df["gender"].apply(lambda x : x.swapcase()))
df

    id         name  class  mark  gender
0    1     John Deo   Four    75  female
1    2     Max Ruin  Three    85    male
2    3       Arnold  Three    55    male
3    4   Krish Star   Four    60  female
4    5    John Mike   Four    60  female
5    6    Alex John   Four    55    male
6    7  My John Rob  Fifth    78    male
7    8       Asruid   Five    85    male
8    9      Tes Qry    Six    78    male
9   10     Big John   Four    55  female
10  11       Ronald    Six    89  female
11  12        Recky    Six    94  female
12  13          Kty  Seven    88  female
13  14         Bigy  Seven    88  female
14  15     Tade Row   Four    88    male
15  16        Gimmy   Four    88    male
16  17        Tumyu    Six    54    male
17  18        Honny   Five    75    male
18  19        Tinny   Nine    18    male
19  20       Jackly   Nine    65  female
20  21   Babby John   Four    69  female
21  22       Reggid  Seven    55  female
22  23        Herod  Eight    79    male
23  24    Tiddy Now  Seven    78    male
24  25     Giff Tow  Seven    88    male
25  26       Crelea  Seven    79    male
26  27     Big Nose  Three    81  female
27  28    Rojj Base  Seven    86  female
28  29  Tess Played  Seven    55    male
29  30    Reppy Red    Six    79  female
30  31  Marry Toeey   Four    88    male
31  32    Binn Rott  Seven    90  female
32  33    Kenn Rein    Six    96  female
33  34     Gain Toe  Seven    69    male
34  35   Rows Noump    Six    88  female
35  36        Pablo   Five    45    Male

In [58]:
df.head(3)

   id      name  class  mark  gender
0   1  John Deo   Four    75  female
1   2  Max Ruin  Three    85    male
2   3    Arnold  Three    55    male

In [59]:
df["name"] = pd.DataFrame(df["name"].apply(lambda x : x.upper()))
df

    id         name  class  mark  gender
0    1     JOHN DEO   Four    75  female
1    2     MAX RUIN  Three    85    male
2    3       ARNOLD  Three    55    male
3    4   KRISH STAR   Four    60  female
4    5    JOHN MIKE   Four    60  female
5    6    ALEX JOHN   Four    55    male
6    7  MY JOHN ROB  Fifth    78    male
7    8       ASRUID   Five    85    male
8    9      TES QRY    Six    78    male
9   10     BIG JOHN   Four    55  female
10  11       RONALD    Six    89  female
11  12        RECKY    Six    94  female
12  13          KTY  Seven    88  female
13  14         BIGY  Seven    88  female
14  15     TADE ROW   Four    88    male
15  16        GIMMY   Four    88    male
16  17        TUMYU    Six    54    male
17  18        HONNY   Five    75    male
18  19        TINNY   Nine    18    male
19  20       JACKLY   Nine    65  female
20  21   BABBY JOHN   Four    69  female
21  22       REGGID  Seven    55  female
22  23        HEROD  Eight    79    male
23  24    TIDDY NOW  Seven    78    male
24  25     GIFF TOW  Seven    88    male
25  26       CRELEA  Seven    79    male
26  27     BIG NOSE  Three    81  female
27  28    ROJJ BASE  Seven    86  female
28  29  TESS PLAYED  Seven    55    male
29  30    REPPY RED    Six    79  female
30  31  MARRY TOEEY   Four    88    male
31  32    BINN ROTT  Seven    90  female
32  33    KENN REIN    Six    96  female
33  34     GAIN TOE  Seven    69    male
34  35   ROWS NOUMP    Six    88  female
35  36        PABLO   Five    45    Male

In [60]:
df["name"] = pd.DataFrame(df["name"].apply(lambda x : x.title()))
df

    id         name  class  mark  gender
0    1     John Deo   Four    75  female
1    2     Max Ruin  Three    85    male
2    3       Arnold  Three    55    male
3    4   Krish Star   Four    60  female
4    5    John Mike   Four    60  female
5    6    Alex John   Four    55    male
6    7  My John Rob  Fifth    78    male
7    8       Asruid   Five    85    male
8    9      Tes Qry    Six    78    male
9   10     Big John   Four    55  female
10  11       Ronald    Six    89  female
11  12        Recky    Six    94  female
12  13          Kty  Seven    88  female
13  14         Bigy  Seven    88  female
14  15     Tade Row   Four    88    male
15  16        Gimmy   Four    88    male
16  17        Tumyu    Six    54    male
17  18        Honny   Five    75    male
18  19        Tinny   Nine    18    male
19  20       Jackly   Nine    65  female
20  21   Babby John   Four    69  female
21  22       Reggid  Seven    55  female
22  23        Herod  Eight    79    male
23  24    Tiddy Now  Seven    78    male
24  25     Giff Tow  Seven    88    male
25  26       Crelea  Seven    79    male
26  27     Big Nose  Three    81  female
27  28    Rojj Base  Seven    86  female
28  29  Tess Played  Seven    55    male
29  30    Reppy Red    Six    79  female
30  31  Marry Toeey   Four    88    male
31  32    Binn Rott  Seven    90  female
32  33    Kenn Rein    Six    96  female
33  34     Gain Toe  Seven    69    male
34  35   Rows Noump    Six    88  female
35  36        Pablo   Five    45    Male

In [61]:
df["gender"] = pd.DataFrame(df["gender"].apply(lambda x : x.title()))
df

    id         name  class  mark  gender
0    1     John Deo   Four    75  Female
1    2     Max Ruin  Three    85    Male
2    3       Arnold  Three    55    Male
3    4   Krish Star   Four    60  Female
4    5    John Mike   Four    60  Female
5    6    Alex John   Four    55    Male
6    7  My John Rob  Fifth    78    Male
7    8       Asruid   Five    85    Male
8    9      Tes Qry    Six    78    Male
9   10     Big John   Four    55  Female
10  11       Ronald    Six    89  Female
11  12        Recky    Six    94  Female
12  13          Kty  Seven    88  Female
13  14         Bigy  Seven    88  Female
14  15     Tade Row   Four    88    Male
15  16        Gimmy   Four    88    Male
16  17        Tumyu    Six    54    Male
17  18        Honny   Five    75    Male
18  19        Tinny   Nine    18    Male
19  20       Jackly   Nine    65  Female
20  21   Babby John   Four    69  Female
21  22       Reggid  Seven    55  Female
22  23        Herod  Eight    79    Male
23  24    Tiddy Now  Seven    78    Male
24  25     Giff Tow  Seven    88    Male
25  26       Crelea  Seven    79    Male
26  27     Big Nose  Three    81  Female
27  28    Rojj Base  Seven    86  Female
28  29  Tess Played  Seven    55    Male
29  30    Reppy Red    Six    79  Female
30  31  Marry Toeey   Four    88    Male
31  32    Binn Rott  Seven    90  Female
32  33    Kenn Rein    Six    96  Female
33  34     Gain Toe  Seven    69    Male
34  35   Rows Noump    Six    88  Female
35  36        Pablo   Five    45    Male

In [62]:
list1 = ['Amir ',' Ashwin',' Bhakti ',' Amol','Aishwarya ','Satyam ']
s1 = pd.Series(list1)
s1

0         Amir
1        Ashwin
2       Bhakti
3          Amol
4    Aishwarya
5       Satyam
dtype: object

In [63]:
s1 = s1.apply(lambda x : x.strip())
s1

0         Amir
1       Ashwin
2       Bhakti
3         Amol
4    Aishwarya
5       Satyam
dtype: object

In [64]:
s1.to_numpy().tolist()

['Amir', 'Ashwin', 'Bhakti', 'Amol', 'Aishwarya', 'Satyam']

In [65]:
data = {'year': [1700, 1850, 2000, 2300, 1950]}
df = pd.DataFrame(data)
df

   year
0  1700
1  1850
2  2000
3  2300
4  1950

In [66]:
result = df.loc[(df["year"]>=1800) & (df["year"]<=2200)]
result

   year
1  1850
2  2000
4  1950

In [67]:
df1 = pd.DataFrame(np.random.randint(1,10,(3,3)),columns=list('ABC'),index=list('pqr'))
df2 = pd.DataFrame(np.random.randint(100,1000,(4,4)),columns=list('ABCD'),index=list('pqrs'))
df1

   A  B  C
p  7  6  8
q  4  8  3
r  3  5  7

In [68]:
df2

     A    B    C    D
p  966  711  819  116
q  926  287  319  605
r  819  561  803  480
s  120  206  843  855

In [70]:
result = pd.merge(df1,df2,how="outer")
result

     A    B    C      D
0    7    6    8    NaN
1    4    8    3    NaN
2    3    5    7    NaN
3  966  711  819  116.0
4  926  287  319  605.0
5  819  561  803  480.0
6  120  206  843  855.0

In [72]:
result = pd.concat([df1,df2])
result

     A    B    C      D
p    7    6    8    NaN
q    4    8    3    NaN
r    3    5    7    NaN
p  966  711  819  116.0
q  926  287  319  605.0
r  819  561  803  480.0
s  120  206  843  855.0

In [75]:
result = pd.concat([df1,df2],axis=1)
result

     A    B    C    A    B    C    D
p  7.0  6.0  8.0  966  711  819  116
q  4.0  8.0  3.0  926  287  319  605
r  3.0  5.0  7.0  819  561  803  480
s  NaN  NaN  NaN  120  206  843  855

In [76]:
df1=pd.DataFrame({"Name":["Aarathi","Veena","Lakshmipriya","Sriyan"],
"Age":[23,54,34,67],
"Location":["Pune","Bangalore","Pune","Kochi"]})
df2=pd.DataFrame({"Name":["Aara","Anupama","Robin","Dilsha","Ramya"],
"Age":[23,54,34,67,45],
"Maths":[34,45,50,49,46],
"English":[50,49,48,34,89],
"Hindi":[40,45,50,34,67]})
df3=pd.DataFrame({"Name":["Aarathi","Veena","Sriyan","Dilsha","Arohi"],
"Salary":[80000,70000,90000,780000,90000]})
df1

           Name  Age   Location
0       Aarathi   23       Pune
1         Veena   54  Bangalore
2  Lakshmipriya   34       Pune
3        Sriyan   67      Kochi

In [77]:
df2

      Name  Age  Maths  English  Hindi
0     Aara   23     34       50     40
1  Anupama   54     45       49     45
2    Robin   34     50       48     50
3   Dilsha   67     49       34     34
4    Ramya   45     46       89     67

In [78]:
df3

      Name  Salary
0  Aarathi   80000
1    Veena   70000
2   Sriyan   90000
3   Dilsha  780000
4    Arohi   90000

In [80]:
concat_df = pd.concat([df1,df2])
concat_df

           Name  Age   Location  Maths  English  Hindi
0       Aarathi   23       Pune    NaN      NaN    NaN
1         Veena   54  Bangalore    NaN      NaN    NaN
2  Lakshmipriya   34       Pune    NaN      NaN    NaN
3        Sriyan   67      Kochi    NaN      NaN    NaN
0          Aara   23        NaN   34.0     50.0   40.0
1       Anupama   54        NaN   45.0     49.0   45.0
2         Robin   34        NaN   50.0     48.0   50.0
3        Dilsha   67        NaN   49.0     34.0   34.0
4         Ramya   45        NaN   46.0     89.0   67.0

In [81]:
result = pd.merge(concat_df,df3,on="Name")
result

      Name  Age   Location  Maths  English  Hindi  Salary
0  Aarathi   23       Pune    NaN      NaN    NaN   80000
1    Veena   54  Bangalore    NaN      NaN    NaN   70000
2   Sriyan   67      Kochi    NaN      NaN    NaN   90000
3   Dilsha   67        NaN   49.0     34.0   34.0  780000

In [82]:
df1 = pd.DataFrame({"Name":["Aarathi","Veena","Lakshmipriya","Amit","Sriyan"],
"ID_card":['BSL004','BSL006','BSL010','BSL003','BSL007'],
"Physics":[94,86,73,96,75],
"Cemistry":[85,91,89,78,81]})
df2 = pd.DataFrame({"Name":["Aarathi","Veena","Manoj","Lakshmipriya","Sriyan"],
"ID_card":['BSL001','BSL005','BSL009','BSL008','BSL002'],
"Maths":[88,72,69,97,45],
"Biology":[98,75,86,61,64]})
df1

           Name ID_card  Physics  Cemistry
0       Aarathi  BSL004       94        85
1         Veena  BSL006       86        91
2  Lakshmipriya  BSL010       73        89
3          Amit  BSL003       96        78
4        Sriyan  BSL007       75        81

In [83]:
df2

           Name ID_card  Maths  Biology
0       Aarathi  BSL001     88       98
1         Veena  BSL005     72       75
2         Manoj  BSL009     69       86
3  Lakshmipriya  BSL008     97       61
4        Sriyan  BSL002     45       64

In [85]:
result = pd.merge(df1,df2,on=["Name","ID_card"],how="outer")
result

           Name ID_card  Physics  Cemistry  Maths  Biology
0       Aarathi  BSL004     94.0      85.0    NaN      NaN
1         Veena  BSL006     86.0      91.0    NaN      NaN
2  Lakshmipriya  BSL010     73.0      89.0    NaN      NaN
3          Amit  BSL003     96.0      78.0    NaN      NaN
4        Sriyan  BSL007     75.0      81.0    NaN      NaN
5       Aarathi  BSL001      NaN       NaN   88.0     98.0
6         Veena  BSL005      NaN       NaN   72.0     75.0
7         Manoj  BSL009      NaN       NaN   69.0     86.0
8  Lakshmipriya  BSL008      NaN       NaN   97.0     61.0
9        Sriyan  BSL002      NaN       NaN   45.0     64.0

In [86]:
df1

           Name ID_card  Physics  Cemistry
0       Aarathi  BSL004       94        85
1         Veena  BSL006       86        91
2  Lakshmipriya  BSL010       73        89
3          Amit  BSL003       96        78
4        Sriyan  BSL007       75        81

In [87]:
df2

           Name ID_card  Maths  Biology
0       Aarathi  BSL001     88       98
1         Veena  BSL005     72       75
2         Manoj  BSL009     69       86
3  Lakshmipriya  BSL008     97       61
4        Sriyan  BSL002     45       64

In [88]:
result = pd.merge(df1,df2,how="left")
result

           Name ID_card  Physics  Cemistry  Maths  Biology
0       Aarathi  BSL004       94        85    NaN      NaN
1         Veena  BSL006       86        91    NaN      NaN
2  Lakshmipriya  BSL010       73        89    NaN      NaN
3          Amit  BSL003       96        78    NaN      NaN
4        Sriyan  BSL007       75        81    NaN      NaN

In [89]:
result = pd.merge(df1,df2,on="Name",how="inner")
result

           Name ID_card_x  Physics  Cemistry ID_card_y  Maths  Biology
0       Aarathi    BSL004       94        85    BSL001     88       98
1         Veena    BSL006       86        91    BSL005     72       75
2  Lakshmipriya    BSL010       73        89    BSL008     97       61
3        Sriyan    BSL007       75        81    BSL002     45       64

In [90]:
result = pd.merge(df1,df2,how="right",on="Name")
result

           Name ID_card_x  Physics  Cemistry ID_card_y  Maths  Biology
0       Aarathi    BSL004     94.0      85.0    BSL001     88       98
1         Veena    BSL006     86.0      91.0    BSL005     72       75
2         Manoj       NaN      NaN       NaN    BSL009     69       86
3  Lakshmipriya    BSL010     73.0      89.0    BSL008     97       61
4        Sriyan    BSL007     75.0      81.0    BSL002     45       64

In [91]:
english_df = pd.DataFrame({'Name':['Amir','Salman','Maaz','Tanvir','Fahad'],
'Surname':['Arkar','Mulla','Surve','Kadvekar','Antule'],
'Marks':[94,86,91,93,88]})
maths_df = pd.DataFrame({'Name':['Amir','Salman','Maaz','Tanvir','Fahad'],
'Surname':['Khan','Mulla','Hafiz','Kadvekar','Shaikh'],
'Marks':[91,89,93,87,84]})
english_df

     Name   Surname  Marks
0    Amir     Arkar     94
1  Salman     Mulla     86
2    Maaz     Surve     91
3  Tanvir  Kadvekar     93
4   Fahad    Antule     88

In [92]:
maths_df

     Name   Surname  Marks
0    Amir      Khan     91
1  Salman     Mulla     89
2    Maaz     Hafiz     93
3  Tanvir  Kadvekar     87
4   Fahad    Shaikh     84

In [94]:
result = pd.merge(english_df,maths_df,how="inner",on=["Name","Surname"],suffixes=["Eng","Math"])
result

     Name   Surname  MarksEng  MarksMath
0  Salman     Mulla        86         89
1  Tanvir  Kadvekar        93         87

In [95]:
physics_df = pd.DataFrame({'Name_1':['Amir','Salman','Maaz','Karim','Fahad'],
'Surname':['Arkar','Mulla','Surve','Kadvekar','Antule'],
'Marks':[94,86,91,93,88]})
chemistry_df = pd.DataFrame({'Name_2':['Asif','Salman','Maaz','Tanvir','Fahad'],
'Surname':['Khan','Mulla','Hafiz','Rawal','Shaikh'],
'Marks':[91,89,93,87,84]})
physics_df

   Name_1   Surname  Marks
0    Amir     Arkar     94
1  Salman     Mulla     86
2    Maaz     Surve     91
3   Karim  Kadvekar     93
4   Fahad    Antule     88

In [96]:
chemistry_df

   Name_2 Surname  Marks
0    Asif    Khan     91
1  Salman   Mulla     89
2    Maaz   Hafiz     93
3  Tanvir   Rawal     87
4   Fahad  Shaikh     84

In [98]:
result = pd.merge(physics_df,chemistry_df,how="inner",left_on="Name_1",right_on="Name_2",suffixes=["_1","_2"])
result

   Name_1 Surname_1  Marks_1  Name_2 Surname_2  Marks_2
0  Salman     Mulla       86  Salman     Mulla       89
1    Maaz     Surve       91    Maaz     Hafiz       93
2   Fahad    Antule       88   Fahad    Shaikh       84

In [99]:
df = pd.read_csv("movies_data.csv")
df.head(3)

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."

In [100]:
result = df.sort_values("duration" , ascending=False , ignore_index=True)
result

,star_rating,title,content_rating,genre,duration,actors_list
0,7.8,Hamlet,PG-13,Drama,242,"[u'Kenneth Branagh', u'Julie Christie', u'Dere..."
1,8.2,Gone with the Wind,G,Drama,238,"[u'Clark Gable', u'Vivien Leigh', u'Thomas Mit..."
2,8.4,Once Upon a Time in America,R,Crime,229,"[u'Robert De Niro', u'James Woods', u'Elizabet..."
3,8.3,Lagaan: Once Upon a Time in India,PG,Adventure,224,"[u'Aamir Khan', u'Gracy Singh', u'Rachel Shell..."
4,7.9,The Ten Commandments,APPROVED,Adventure,220,"[u'Charlton Heston', u'Yul Brynner', u'Anne Ba..."
...,...,...,...,...,...,...
974,8.1,Duck Soup,PASSED,Comedy,68,"[u'Groucho Marx', u'Harpo Marx', u'Chico Marx']"
975,8.4,The Kid,NOT RATED,Comedy,68,"[u'Charles Chaplin', u'Edna Purviance', u'Jack..."
976,8.1,The Cabinet of Dr. Caligari,UNRATED,Crime,67,"[u'Werner Krauss', u'Conrad Veidt', u'Friedric..."
977,8.0,Battleship Potemkin,UNRATED,History,66,"[u'Aleksandr Antonov', u'Vladimir Barsky', u'G..."
978,8.0,Freaks,UNRATED,Drama,64,"[u'Wallace Ford', u'Leila Hyams', u'Olga Bacla..."

In [102]:
longest_runtime = df["duration"].max()
longest_runtime

242

In [103]:
shortest_runtime = df["duration"].min()
shortest_runtime

64

In [104]:
action_crime = df.loc[(df["genre"]=="Crime") | (df["genre"]=="Action")]
action_crime

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."
...,...,...,...,...,...,...
963,7.4,La Femme Nikita,R,Action,118,"[u'Anne Parillaud', u'Marc Duret', u'Patrick F..."
967,7.4,The Rock,R,Action,136,"[u'Sean Connery', u'Nicolas Cage', u'Ed Harris']"
969,7.4,Law Abiding Citizen,R,Crime,109,"[u'Gerard Butler', u'Jamie Foxx', u'Leslie Bibb']"
976,7.4,Master and Commander: The Far Side of the World,PG-13,Action,138,"[u'Russell Crowe', u'Paul Bettany', u'Billy Bo..."
978,7.4,Wall Street,R,Crime,126,"[u'Charlie Sheen', u'Michael Douglas', u'Tamar..."

In [105]:
city_df = pd.DataFrame({'Name':['Amir','Shaibaz','Suhel','Fahad','Adil','Muzaffar','Shuaib','Asif','Awez','Muzammil'],
'City':['Georgia','California','Los Angeles','California','Los Angeles','Georgia','Los Angeles',
'California','Los Angeles','California']})
city_df

       Name         City
0      Amir      Georgia
1   Shaibaz   California
2     Suhel  Los Angeles
3     Fahad   California
4      Adil  Los Angeles
5  Muzaffar      Georgia
6    Shuaib  Los Angeles
7      Asif   California
8      Awez  Los Angeles
9  Muzammil   California

In [108]:
result = city_df.groupby(city_df["City"]).size().reset_index(name = "Number of people")
result

          City  Number of people
0   California                 4
1      Georgia                 2
2  Los Angeles                 4

In [109]:
result = city_df.groupby(city_df["City"]).size()
result

City
California     4
Georgia        2
Los Angeles    4
dtype: int64

In [110]:
df = pd.read_csv("Bengaluru_House_Data.csv")
df

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00
...,...,...,...,...,...,...,...,...,...
13315,Built-up Area,Ready To Move,Whitefield,5 Bedroom,ArsiaEx,3453,4.0,0.0,231.00
13316,Super built-up Area,Ready To Move,Richards Town,4 BHK,NaN,3600,5.0,NaN,400.00
13317,Built-up Area,Ready To Move,Raja Rajeshwari Nagar,2 BHK,Mahla T,1141,2.0,1.0,60.00
13318,Super built-up Area,18-Jun,Padmanabhanagar,4 BHK,SollyCl,4689,4.0,1.0,488.00
13319,Super built-up Area,Ready To Move,Doddathoguru,1 BHK,NaN,550,1.0,1.0,17.00

In [111]:
df.isna().sum()

area_type          0
availability       0
location           1
size              16
society         5502
total_sqft         0
bath              73
balcony          609
price              0
dtype: int64

In [112]:
df.fillna(0)

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,0,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,0,1200,2.0,1.0,51.00
...,...,...,...,...,...,...,...,...,...
13315,Built-up Area,Ready To Move,Whitefield,5 Bedroom,ArsiaEx,3453,4.0,0.0,231.00
13316,Super built-up Area,Ready To Move,Richards Town,4 BHK,0,3600,5.0,0.0,400.00
13317,Built-up Area,Ready To Move,Raja Rajeshwari Nagar,2 BHK,Mahla T,1141,2.0,1.0,60.00
13318,Super built-up Area,18-Jun,Padmanabhanagar,4 BHK,SollyCl,4689,4.0,1.0,488.00
13319,Super built-up Area,Ready To Move,Doddathoguru,1 BHK,0,550,1.0,1.0,17.00

In [113]:
df.replace({np.nan : 0})

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,0,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,0,1200,2.0,1.0,51.00
...,...,...,...,...,...,...,...,...,...
13315,Built-up Area,Ready To Move,Whitefield,5 Bedroom,ArsiaEx,3453,4.0,0.0,231.00
13316,Super built-up Area,Ready To Move,Richards Town,4 BHK,0,3600,5.0,0.0,400.00
13317,Built-up Area,Ready To Move,Raja Rajeshwari Nagar,2 BHK,Mahla T,1141,2.0,1.0,60.00
13318,Super built-up Area,18-Jun,Padmanabhanagar,4 BHK,SollyCl,4689,4.0,1.0,488.00
13319,Super built-up Area,Ready To Move,Doddathoguru,1 BHK,0,550,1.0,1.0,17.00

In [114]:
df = pd.DataFrame({'col1':[1,4,3,4,5],
'col2':[4,5,6,7,8],
'col3':[7,8,9,0,1]})
df

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

In [116]:
df.drop([0,2,4],axis=0,inplace=True)
df

   col1  col2  col3
1     4     5     8
3     4     7     0

In [1]:
user_input = input("Enter a string:")
for i in user_input:
    print(i)

A
b
h
i
s
h
e
k

In [3]:
for i in user_input:
    print(i,end="")

Abhishek

In [4]:
string = "Machine Learning"
result = len(string)
print(result)

16

In [5]:
count = 0 
for i in string:
    count += 1
print("Length of the string: ",count)

Length of the string:  16

In [6]:
sentence = "This is orange juice"
keyword = "orange"

if keyword in sentence:
    print(f"{keyword} is present in the sentence")
else:
    print(f"{keyword} is not present in the sentence")

orange is present in the sentence

In [7]:
input_string = input("Enter a string:")
vowels = "aeiou"
consonants = "bcdfghjklmnpqrstvwxyz"
digits = "0123456789"
vowel_count = 0 
consonant_count = 0
digit_count = 0
whitespace_count = 0 
for char in input_string:
    if char.lower() in vowels:
        vowel_count += 1
    if char.lower() in consonants:
        consonant_count += 1
    if char in digits:
        digit_count += 1
    if char.isspace():
        whitespace_count += 1
print("Vowels count : ", vowel_count)
print("Consonant count : ", consonant_count)
print("Digit count : ", digit_count)
print("Whitespace count : ", whitespace_count)

Vowels count :  7
Consonant count :  10
Digit count :  0
Whitespace count :  2

In [9]:
input_string = input("Enter a string:")
uppercase_count = 0 
lowercase_count = 0 
special_count = 0
numeric_count = 0
for char in input_string:
    if char.islower():
        lowercase_count += 1
    if char.isupper():
        uppercase_count += 1
    if char.isdigit():
        numeric_count += 1
    else:
        special_count += 1
print("Upper case count: ", uppercase_count)
print("Lower case count: ",lowercase_count)
print("Special count: ",special_count)
print("Number of digits: ",numeric_count)

Upper case count:  2
Lower case count:  15
Special count:  18
Number of digits:  0

In [10]:
input_string = "Hello,have a good day"
vowels = "aeiouAEIOU"
new_string = ""
for char in input_string:
    if char.isalpha() and char not in vowels:
        new_string += char
print("original string:",input_string)
print("New string with consonants deleted:",new_string)

original string: Hello,have a good day
New string with consonants deleted: Hllhvgddy

In [11]:
input_string = "Hello,have a good day"
vowels = "aeiouAEIOU"
new_string = ""
for char in input_string:
    if char.isalpha() and char not in vowels:
        new_string += char
print("original string:",input_string)
print("New string with consonants deleted:",new_string)

original string: Hello,have a good day
New string with consonants deleted: Hllhvgddy

In [12]:
input_string = input("Enter a non empty string:")
index = int(input("Enter the index of the character to be removed:"))

if index < 0 and index>len(input_string):
    print("Invalid Index")
else:
    new_string = input_string[:index] + input_string[index+1:]
    print("Original string:",input_string)
    print("New string with index removed:",new_string)

Original string: abhishek wakchaure
New string with index removed: abhisek wakchaure

In [13]:
input_string = input("Enter a string:")
if len(input_string) < 2:
    print("String Should have at least 2 characters")
else:
    new_string = input_string[-1] + input_string[1:-1] + input_string[0]
    print("Original string:",input_string)
    print("String with last and first characters exchanged:",new_string)

Original string: Abhishek
String with last and first characters exchanged: kbhisheA

In [14]:
s = str(input("Enter a string:"))
word = ""
for i in s:
    word = i 
    count = s.count(word)
    print(f"In the given string{word} is been repeated {count} times")

In the given stringA is been repeated 1 times
In the given stringb is been repeated 1 times
In the given stringh is been repeated 2 times
In the given stringi is been repeated 1 times
In the given strings is been repeated 1 times
In the given stringh is been repeated 2 times
In the given stringe is been repeated 1 times
In the given stringk is been repeated 1 times

In [15]:
s = str(input("Enter a string:"))
word = ""
for i in s:
    word = i 
    count = s.count(word)
    print(f"In the given string{word} is repeated {count} times")

In the given stringW is repeated 1 times
In the given stringa is repeated 2 times
In the given stringk is repeated 1 times
In the given stringc is repeated 1 times
In the given stringh is repeated 1 times
In the given stringa is repeated 2 times
In the given stringu is repeated 1 times
In the given stringr is repeated 1 times
In the given stringe is repeated 1 times

In [17]:
input_string = input("Enter a string:")
result = input_string[-10:]
result

' Wakchaure'

In [18]:
input_string = input("Enter a string:")
uppercase_count = 0 
for char in input_string[:4]:
    if char.isupper():
        uppercase_count += 1
if uppercase_count >=2:
    uppercase_string = input_string.upper()
    print("Upper case string:",uppercase_string)
else:
    print("No conversion required.String doesnot meet the condition.")

Upper case string: ABHISHEK WAKCHAURE

In [20]:
input_string = "This is a string with a newline.\n"
new_string = input_string.replace("\n","")
print("Original string:",input_string)
print("New string without newline:",new_string)

Original string: This is a string with a newline.

New string without newline: This is a string with a newline.

In [21]:
input_string = "32.054,23"
result = input_string.replace(",","*").replace(".",",").replace("*",".")
result

'32,054.23'

In [22]:
input_string = input("Enter a string:")
char_count = {}
for char in input_string:
    if char in char_count:
        print("First Repeated character:",char)
        break
    char_count[char] = 1
else:
    print("No repeated character found")

First Repeated character: h

In [23]:
input_string = input("Enter a string:")
char_count = {}
for char in input_string:
    if char in char_count:
        print("First Repeated character:",char)
        break
    char_count[char] = 1
else:
    print("No repeated character found")

First Repeated character: a

In [25]:
input_string = input("Enter a string:")
even_count = 0 
odd_count = 0
for char in input_string:
    if char.isdigit():
        num = int(char)
        if num%2 == 0:
            even_count += 1
        else:
            odd_count += 1
print("Even numbers count :",even_count)
print("odd number count :",odd_count)

Even numbers count : 0
odd number count : 0

In [26]:
input_string = input("Enter a string:")
if input_string.isdigit():
    print("String contains only digits")
else:
    print("String contains alphabetes")

String contains alphabetes

In [27]:
input_string = input("Enter a string:")
if input_string.isdigit():
    print("String contains only digits")
else:
    print("String contains alphabetes")

String contains alphabetes

In [29]:
a = input("Enter a string:")
list1 = list(a)
print(list1)
x = input("")
if x in list1:
    list1.remove(x)
    print(list1)
else:
    print("Character not found")
result1 = ""
result = result1.join(list1)
print(result)

['a', 'b', 'h', 'i', 'h', 's', 'e', 'k']
['b', 'h', 'i', 'h', 's', 'e', 'k']
bhihsek

In [30]:
a = input("Enter a string:")
k = []
for i in a:
    if a.index(i)%2!=0:
        k.append(i)
print(k)

['b', 'i', 'k']

In [31]:
a = input("Enter a string:")
k = []
for i in a:
    if a.index(i)%2!=0:
        k.append(i)
print(k)

['a', 'c', 'a', 'r']

In [32]:
input_string = input("Enter a string:")
if len(input_string)%5==0:
    result = input_string[::-1]
    print(result)
else:
    print("Length is not multiple of 5")

1 kehsihbA

In [33]:
input_string = input("Enter a string:")
if len(input_string)%5==0:
    result = input_string[::-1]
    print(result)
else:
    print("Length is not multiple of 5")

Length is not multiple of 5

In [34]:
input_string = input("Enter a string:")
output = []
for i in input_string:
    output = input_string[::-1]
print(output)

kehsihba

In [35]:
input_string = input("Enter a string:")
output = input_string.swapcase()
print(output)

ABHISHEKwAKCHAURe

In [36]:
input_string = input("Enter a string:")
output = input_string.replace(" ","")
print(output)

abhishekwakchaure

In [38]:
input_string = input("Enter a string:")
output = []
for i in input_string:
    if i not in output:
        output.append(i)
print(output)

['A', 'b', 'h', 'i', 's', 'e', 'k', ' ', 'W', 'a', 'c', 'u', 'r']

In [39]:
input_string = input("Enter a string:")
output = []
for i in input_string:
    if i not in output:
        output.append(i)
print(output)

['a', 'b', 'h', 'i', 's', 'e', 'k']

In [40]:
num = eval(input("Enter a number:"))
for i in range(1 , num+1):
    print(i*i)

1
4
9
16
25

In [41]:
num = eval(input("ENter a number:"))
for i in range(1 , num+1):
    print(i*i)

1
4
9
16
25
36
49
64
81
100

In [42]:
num = eval(input("Enter a number:"))
for i in range(1 , num+1):
    print(i**3)

1
8
27
64
125

In [43]:
num = eval(input("Enter a number:"))
for i in range(2 , num):
    if i%2 == 0:
        print("Not prime")
        break
    else:
        print("Prime number")
        break

Not prime

In [45]:
num = eval(input("Enter a number:"))
for i in range(2 , num):
    if num%i == 0:
        print("Not prime")
        break
    else:
        print("Prime number")
        break

Prime number

In [46]:
num = eval(input("Enter a number:"))
for i in range(2 , num):
    if num%i == 0:
        print("Not prime")
        break
    else:
        print("Prime number")
        break

Prime number

In [47]:
num = eval(input("Enter a number:"))
for i in range(2 , num):
    if num%i==0:
        print("Not Prime")
        break
    else:
        print("Prime number")
        break

Not Prime

In [48]:
s = str(input("Enter a string:"))
for i in s:
    print(i)

a
b
h
i
s
h
e
k

In [1]:
list1 = [1,2,3,4,5]
result = max(list1)
result

5

In [2]:
list1 = [1,2,3,4,5]
max1 = list1[1]
for i in list1:
    if i > max1:
        largest = i 
    else:
        largest = max1
print(largest)

5

In [3]:
list1 = [1,2,3,4,5]
max1 = list1[3]
for i in list1:
    if i > max1:
        largest = i 
    else:
        largest = max1
print(largest)

5

In [5]:
list1 = [4,5,8,9,5,3,7]
list1.sort()
list1
result = list1[-1]
result

9

In [7]:
list1 = [4,5,8,9,5,3,7]
list1.sort(reverse=True)
list1
result = list1[0]
result

9

In [9]:
list1 = [4,5,8,9,5,3,7]
list1[-1:] + list1[1:-1] + list1[:1]

[7, 5, 8, 9, 5, 3, 4]

In [10]:
list1 = [4,5,8,9,5,3,7]
list1[-1:] + list1[1:-1] + list1[:1]

[7, 5, 8, 9, 5, 3, 4]

In [11]:
list1 = [4,5,8,9,5,3,7]
list1[0],list1[6] = list1[6],list1[0]
list1

[7, 5, 8, 9, 5, 3, 4]

In [12]:
list1 = [4,5,8,9,5,3,7]
list1[0],list1[1] = list1[1],list1[0]
list1

[5, 4, 8, 9, 5, 3, 7]

In [13]:
list1 = [4,5,8,9,5,3,7]
pos1 = int(input("Enter position 1:"))
pos2 = int(input("Enter position 2:"))
list1[pos1],list1[pos2] = list1[pos2],list1[pos1]
list1

[4, 9, 8, 5, 5, 3, 7]

In [14]:
list1 = [4,5,8,9,5,3,7]
list1.reverse()
list1

[7, 3, 5, 9, 8, 5, 4]

In [16]:
list1 = [4,5,8,9,5,3,7]
result = reversed(list1)
list(result)

[7, 3, 5, 9, 8, 5, 4]

In [17]:
list1 = [4,5,8,9,5,3,7]
list2 = []
for i in range(len(list1) , 0 , -1):
    list2.append(i)
list2

[7, 6, 5, 4, 3, 2, 1]

In [18]:
list1 = [1,2,1,2,1,1,1,3,4,4]
list1.count(1)

5

In [19]:
list1 = [1,2,1,2,1,1,1,3,4,4]
num1 = 1 
count1 = 0
for i in list1:
    if i == num1:
        count1 += 1
print(count1)

5

In [20]:
list1 = [1,2,3,4,5]
sum1 = 0 
for i in list1:
    sum1 = sum1 + i 
print(sum1)

15

In [21]:
list1 = [1,2,3,4,5]
mul = 1 
for i in list1:
    mul = mul * i 
print(mul)

120

In [22]:
list1 = [1,2,3,4,5]
len(list1)

5

In [23]:
list1 = [1,2,3,4,5]
print(range(len(list1)))

range(0, 5)

In [24]:
list1 = [1,2,3,4,5]
count1 = 0 
for i in list1:
    count1 += 1
print(count1)

5

In [25]:
list1 = [1,2,3,4,5]
smallest = list1[4]
for i in range(len(list1)):
    if list1[i] <= smallest:
        smallest = list1[i]
print("Smallest number in the list:",smallest)

largest = list1[0]
for i in range(len(list1)):
    if list1[i] >= largest:
        largest = list1[i]
print("Largest number in the list:",largest)

Smallest number in the list: 1
Largest number in the list: 5

In [26]:
list1 = []
num = int(input("ENter the numbers you want in the list:"))
for i in range(num):
    item = int(input("Enter the number you want in the list:"))
    list1.append(i)
print("List is:",list1)

num1 = int(input("Enter the number you want to remove from the list:"))
for i in range(len(list1)):
    if list1[i] == num1:
        list1.remove(num1)
        print("Deleted number from list:",num1)
        print(list1)
        break
    else:
        print("Number not found in the list")

List is: [0, 1, 2, 3, 4]
Number not found in the list
Number not found in the list
Number not found in the list
Number not found in the list
Deleted number from list: 4
[0, 1, 2, 3]

In [27]:
list1 = [2,5,6,12]
list2 = []
for i in list1:
    list2.append(i**2)
print("Original list:",list1)
print("Squared list:",list2)

Original list: [2, 5, 6, 12]
Squared list: [4, 25, 36, 144]

In [28]:
list1 = [2,5,6,12]
list2 = [(i**2) for i in list1]
list2

[4, 25, 36, 144]

In [29]:
list2 = [(i**3) for i in list1]
list2

[8, 125, 216, 1728]

In [30]:
even_numbers = []
odd_numbers = []
for i in range(0 , 152):
    if i%2==0:
        even_numbers.append(i)
    else:
        odd_numbers.append(i)
print("Even numbers are:",even_numbers)
print("odd numbers are:",odd_numbers)

Even numbers are: [0, 2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98, 100, 102, 104, 106, 108, 110, 112, 114, 116, 118, 120, 122, 124, 126, 128, 130, 132, 134, 136, 138, 140, 142, 144, 146, 148, 150]
odd numbers are: [1, 3, 5, 7, 9, 11, 13, 15, 17, 19, 21, 23, 25, 27, 29, 31, 33, 35, 37, 39, 41, 43, 45, 47, 49, 51, 53, 55, 57, 59, 61, 63, 65, 67, 69, 71, 73, 75, 77, 79, 81, 83, 85, 87, 89, 91, 93, 95, 97, 99, 101, 103, 105, 107, 109, 111, 113, 115, 117, 119, 121, 123, 125, 127, 129, 131, 133, 135, 137, 139, 141, 143, 145, 147, 149, 151]

In [31]:
even_numbers = []
even_count = 0 
odd_numbers = []
odd_count = 0
for i in range(0 , 152):
    if i % 2 == 0:
        even_numbers.append(i)
        even_count += 1
    else:
        odd_numbers.append(i)
        odd_count += 1
print("Even numbers:",even_numbers)
print("*"*180)
print("Odd Numbers:",odd_numbers)

Even numbers: [0, 2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98, 100, 102, 104, 106, 108, 110, 112, 114, 116, 118, 120, 122, 124, 126, 128, 130, 132, 134, 136, 138, 140, 142, 144, 146, 148, 150]
************************************************************************************************************************************************************************************
Odd Numbers: [1, 3, 5, 7, 9, 11, 13, 15, 17, 19, 21, 23, 25, 27, 29, 31, 33, 35, 37, 39, 41, 43, 45, 47, 49, 51, 53, 55, 57, 59, 61, 63, 65, 67, 69, 71, 73, 75, 77, 79, 81, 83, 85, 87, 89, 91, 93, 95, 97, 99, 101, 103, 105, 107, 109, 111, 113, 115, 117, 119, 121, 123, 125, 127, 129, 131, 133, 135, 137, 139, 141, 143, 145, 147, 149, 151]

In [1]:
divisible_4 = []
divisible_6 = []
divisible_8 = []
divisible_10 = []
divisible_3 = []
divisible_5 = []
divisible_7 = []
divisible_9 = []
for i in range(0 , 152):
    if i % 4 == 0:
        divisible_4.append(i)
    if i % 6 == 0:
        divisible_6.append(i)
    if i % 10 == 0:
        divisible_10.append(i)
    if i % 3 == 0:
        divisible_3.append(i)
    if i % 5 == 0:
        divisible_5.append(i)
    if i % 7 == 0:
        divisible_7.append(i)
    if i % 9 == 0:
        divisible_9.append(i)
print("Numbers divisible by 4 are:",divisible_4)
print()
print("Numbers divisible by 6 are:",divisible_6)
print()
print("Numbers divisible by 8 are:",divisible_8)
print()
print("Numbers divisible by 10 are:",divisible_10)
print()
print("Numbers divisible by 3 are:",divisible_3)
print()
print("Numbers are divisible by 5 are:",divisible_5)
print()
print("Numbers divisible by 7 are:",divisible_7)
print()
print("Numbers divisible by 9 are:",divisible_9)

Numbers divisible by 4 are: [0, 4, 8, 12, 16, 20, 24, 28, 32, 36, 40, 44, 48, 52, 56, 60, 64, 68, 72, 76, 80, 84, 88, 92, 96, 100, 104, 108, 112, 116, 120, 124, 128, 132, 136, 140, 144, 148]

Numbers divisible by 6 are: [0, 6, 12, 18, 24, 30, 36, 42, 48, 54, 60, 66, 72, 78, 84, 90, 96, 102, 108, 114, 120, 126, 132, 138, 144, 150]

Numbers divisible by 8 are: []

Numbers divisible by 10 are: [0, 10, 20, 30, 40, 50, 60, 70, 80, 90, 100, 110, 120, 130, 140, 150]

Numbers divisible by 3 are: [0, 3, 6, 9, 12, 15, 18, 21, 24, 27, 30, 33, 36, 39, 42, 45, 48, 51, 54, 57, 60, 63, 66, 69, 72, 75, 78, 81, 84, 87, 90, 93, 96, 99, 102, 105, 108, 111, 114, 117, 120, 123, 126, 129, 132, 135, 138, 141, 144, 147, 150]

Numbers are divisible by 5 are: [0, 5, 10, 15, 20, 25, 30, 35, 40, 45, 50, 55, 60, 65, 70, 75, 80, 85, 90, 95, 100, 105, 110, 115, 120, 125, 130, 135, 140, 145, 150]

Numbers divisible by 7 are: [0, 7, 14, 21, 28, 35, 42, 49, 56, 63, 70, 77, 84, 91, 98, 105, 112, 119, 126, 133, 140, 147]

Numbers divisible by 9 are: [0, 9, 18, 27, 36, 45, 54, 63, 72, 81, 90, 99, 108, 117, 126, 135, 144]

In [2]:
l1=[1,2,3,"hello","welcome",4.12,5.35]
int_list = []
string_list = []
float_list = []
for i in l1:
    if type(i) == int:
        int_list.append(i)
    if type(i) == float:
        float_list.append(i)
    if type(i) == str:
        string_list.append(i)
print("Integer list: ", int_list)
print()
print("Float list: ", float_list)
print()
print("String list: ", string_list)

Integer list:  [1, 2, 3]

Float list:  [4.12, 5.35]

String list:  ['hello', 'welcome']

In [3]:
l1=[1,2,3,4]
l2=[4,5,6,7]
l2.extend(l1)
l2

[4, 5, 6, 7, 1, 2, 3, 4]

In [4]:
l1=[1,2,3,4]
l2=[4,5,6,7]
l2.append(l1)
l2

[4, 5, 6, 7, [1, 2, 3, 4]]

In [5]:
l2.extend(l1)
l2

[4, 5, 6, 7, [1, 2, 3, 4], 1, 2, 3, 4]

In [6]:
l1=[1,2,3,4]
l2=[4,5,6,7]
l2.extend(l1)
l2

[4, 5, 6, 7, 1, 2, 3, 4]

In [7]:
l1=[10, 2, 4, 5, 6, 2, 9, 1, 7, 5, 4, 11, 30]
sorted_numbers = sorted(set(l1),reverse=True)
print("Sorted list:",sorted_numbers)
print("Third Largest number:",sorted_numbers[2])

Sorted list: [30, 11, 10, 9, 7, 6, 5, 4, 2, 1]
Third Largest number: 10

In [10]:
l1=[10, 2, 4, 5, 6, 2, 9, 1, 7, 5, 4, 11, 30]
sorted_numbers = sorted(l1,reverse=True)
sorted_numbers[2]

10

In [11]:
l1=[1,2,3,4,1,2,3,4]
l2 = {}
for i in l1:
    if i in l2:
        l2[i] = l2[i] + 1
    else:
        l2[i] = 1

print(l2)

{1: 2, 2: 2, 3: 2, 4: 2}

In [12]:
l1=[1,2,3,4,1,2,3,4]
l2 = {}
for i in l1:
    if i in l2:
        l2[i] = l2[i] + 1
    else:
        l2[i] = 1
print(l2)

{1: 2, 2: 2, 3: 2, 4: 2}

In [13]:
l1=[1,2,3,4,1,2,3,4]
l2 = {}
for i in l1:
    if i in l2:
        l2[i] = l2[i] + 1
    else:
        l2[i] = 1
print(l2)

{1: 2, 2: 2, 3: 2, 4: 2}

In [14]:
l1=[[1,2,3,4],1,2,3,4]
l2=[1,2,3,4]
if l2 in l1:
    print("L2 is subset of L1")
else:
    print("L2 is not a subset of L1")

L2 is subset of L1

In [15]:
l1=[[1,2,3,4],1,2,3,4]
l2=[1,2,3,4]
if l2 in l1:
    print("L2 is subset of L1")
else:
    print("L2 is not a subset of L1")

L2 is subset of L1

In [16]:
l1 = [1,2,3]
sub_l1 = [[]]
for i in range(len(l1) + 1):
    for j in range(i):
        sub_l1.append(l1[j:i])
sub_l1

[[], [1], [1, 2], [2], [1, 2, 3], [2, 3], [3]]

In [17]:
l1 = [1,2,3]
sub_l1 = [[]]
for i in range(len(l1) + 1):
    for j in range(i):
        sub_l1.append(l1[j:i])
sub_l1

[[], [1], [1, 2], [2], [1, 2, 3], [2, 3], [3]]

In [18]:
l1=[10,20,30,40]
l2=[10,20,30,50]
result = []
for i in range(len(l1)):
    if l1[i] in l2:
        result.append(l1[i])
result

[10, 20, 30]

In [19]:
l1=[[1,2,3],[4,5,6],[7,8,9]]
from itertools import chain
result = list(chain(*l1))
result

[1, 2, 3, 4, 5, 6, 7, 8, 9]

In [20]:
l1=[[1,2,3],[4,5,6],[7,8,9]]
from itertools import chain 
result = list(chain(*l1))
result

[1, 2, 3, 4, 5, 6, 7, 8, 9]

In [21]:
l1=[[1,2,3],[4,5,6],[7,8,9]]
from itertools import chain
result = list(chain(*l1))
result

[1, 2, 3, 4, 5, 6, 7, 8, 9]

In [22]:
l1=[5,6,7,1,2,3]
result = sorted(l1)
result

[1, 2, 3, 5, 6, 7]

In [23]:
result = sorted(l1,reverse=True)
result

[7, 6, 5, 3, 2, 1]

In [24]:
tuple1 = (2,5,3,1,6,8,4)
result = sorted(tuple1)
result

[1, 2, 3, 4, 5, 6, 8]

In [25]:
l1 = [11, 33, 50]
for i in l1:
    print(i,end="")

113350

In [26]:
l1 = [1]
if l1 == []:
    print("List is empty")
else:
    print("List is not empty")

List is not empty

In [27]:
l1 = []
if l1 == []:
    print("List is empty")
else:
    print("List is not empty")

List is empty

In [28]:
l1=[1,2,3]
l2=[4,5,6]
l1 + l2

[1, 2, 3, 4, 5, 6]

In [29]:
l1=[1,2,3,1,2,3,4,5,6,4,5,6]
l1.count(1)

2

In [30]:
l1.count(2)

2

In [31]:
l1=[[1,2,3],[4,5,6],[7,8,9]]
from itertools import chain
result = list(chain(*l1))
result

[1, 2, 3, 4, 5, 6, 7, 8, 9]

In [32]:
l1=[[1,2,3],[4,5,6],[7,8,9]]
from itertools import chain
result = list(chain(*l1))
result

[1, 2, 3, 4, 5, 6, 7, 8, 9]

In [39]:
from collections import Counter
nums = [3,1,3,4,2]
counts = Counter(nums)
max(counts,key=counts.get)

3

In [1]:
from collections import OrderedDict
dict1 = {'ravi': '10', 'rajnish': '9',
        'sanjeev': '15', 'yash': '2', 'suraj': '32'}
x = OrderedDict(sorted(dict1.items()))
print(x , end=" ")

OrderedDict([('rajnish', '9'), ('ravi', '10'), ('sanjeev', '15'), ('suraj', '32'), ('yash', '2')])

In [2]:
from collections import OrderedDict
dict1 = {'ravi': '10', 'rajnish': '9',
        'sanjeev': '15', 'yash': '2', 'suraj': '32'}
x = OrderedDict(sorted(dict1.items()))
print(x , end=" ")

OrderedDict([('rajnish', '9'), ('ravi', '10'), ('sanjeev', '15'), ('suraj', '32'), ('yash', '2')])

In [3]:
key_value={'l':11,'o':89,'a':88,'d':42,'p':5}
for i in sorted(key_value):
    print((i , key_value[i]),end=" ")

('a', 88) ('d', 42) ('l', 11) ('o', 89) ('p', 5)

In [4]:
dict1 = {'ravi': '10', 'rajnish': '9',
        'sanjeev': '15', 'yash': '2', 'suraj': '32'}
for i in sorted(dict1):
    print((i , dict1[i]),end=" ")

('rajnish', '9') ('ravi', '10') ('sanjeev', '15') ('suraj', '32') ('yash', '2')

In [5]:
dict1 = {'ravi': '10', 'rajnish': '9',
        'sanjeev': '15', 'yash': '2', 'suraj': '32'}
for i in sorted(dict1):
    print((i , dict1[i]),end=" ")

('rajnish', '9') ('ravi', '10') ('sanjeev', '15') ('suraj', '32') ('yash', '2')

In [12]:
dict1 = {'ravi': '10', 'rajnish': '9',
        'sanjeev': '15', 'yash': '2', 'suraj': '32'}
result = {i : j for i , j in sorted(dict1.items() , key=lambda x:x[1])}
result

{'ravi': '10', 'sanjeev': '15', 'yash': '2', 'suraj': '32', 'rajnish': '9'}

In [13]:
result = {i : j for i , j in sorted(dict1.items() , key=lambda x : x[1])}
result

{'ravi': '10', 'sanjeev': '15', 'yash': '2', 'suraj': '32', 'rajnish': '9'}

In [14]:
dt = {'aa':44, 'bb':6, 'cc':3,'dd':12}
result = {i : j for i , j in sorted(dt.items() , key=lambda x : x[1])}
result

{'cc': 3, 'bb': 6, 'dd': 12, 'aa': 44}

In [15]:
dt = {'aa':44, 'bb':6, 'cc':3,'dd':12}
result = {i : j for i , j in sorted(dt.items(),key=lambda x:x[1])}
result

{'cc': 3, 'bb': 6, 'dd': 12, 'aa': 44}

In [17]:
dt = {'aa':44, 'bb':6, 'cc':3,'dd':12}
x = dt.values()
sum(x)

65

In [18]:
dt = {'aa':44, 'bb':6, 'cc':3,'dd':12}
x = dt.values()
sum(x)

65

In [19]:
dt = {'aa':44, 'bb':6, 'cc':3,'dd':12}
list1 = []
for i in dt:
    list1.append(dt[i])
result = sum(list1)
result

65

In [21]:
dt = {'aa':44, 'bb':6, 'cc':3,'dd':12}
list1 = []
for i in dt:
    list1.append(dt[i])
result = sum(list1)
result

65

In [23]:
dt = {'aa':44, 'bb':6, 'cc':3,'dd':12}
sum1 = 0 
for i in dt.values():
    sum1 += i
sum1

65

In [24]:
dt = {'aa':44, 'bb':6, 'cc':3,'dd':12}
sum1 = 0
for i in dt.values():
    sum1 += i
sum1

65

In [26]:
test_dict = {"Arushi": 22, "Mani": 21, "Haritha": 21}
del test_dict["Arushi"]
test_dict

{'Mani': 21, 'Haritha': 21}

In [27]:
test_dict = {"Arushi": 22, "Mani": 21, "Haritha": 21}
del test_dict["Haritha"]
test_dict

{'Arushi': 22, 'Mani': 21}

In [28]:
del test_dict["Mani"]
test_dict

{'Arushi': 22}

In [29]:
test_dict = {"Arushi": 22, "Mani": 21, "Haritha": 21}
test_dict.pop("Arushi")

22

In [30]:
test_dict = {"Charlie Chaplin": 22, "Mani": 21, "Chaplin": 21}
test_dict.pop("Chaplin")

21

In [31]:
test_dict

{'Charlie Chaplin': 22, 'Mani': 21}

In [32]:
d1= {"Arushi": 22, "Mani": 21, "Haritha": 21,'Leena':32}
d2={'aa':44, 'bb':6, 'cc':3,'dd':12}
x = {**d1 , **d2}
x

{'Arushi': 22,
 'Mani': 21,
 'Haritha': 21,
 'Leena': 32,
 'aa': 44,
 'bb': 6,
 'cc': 3,
 'dd': 12}

In [33]:
d1= {"Arushi": 22, "Mani": 21, "Haritha": 21,'Leena':32}
d2={'aa':44, 'bb':6, 'cc':3,'dd':12}
x = {**d1 , **d2}
x

{'Arushi': 22,
 'Mani': 21,
 'Haritha': 21,
 'Leena': 32,
 'aa': 44,
 'bb': 6,
 'cc': 3,
 'dd': 12}

In [34]:
d1= {"Arushi": 22, "Mani": 21, "Haritha": 21,'Leena':32}
d2={'aa':44, 'bb':6, 'cc':3,'dd':12}
x = {**d2 , **d1}
x

{'aa': 44,
 'bb': 6,
 'cc': 3,
 'dd': 12,
 'Arushi': 22,
 'Mani': 21,
 'Haritha': 21,
 'Leena': 32}

In [35]:
d1= {"Arushi": 22, "Mani": 21, "Haritha": 21,'Leena':32}
d2={'aa':44, 'bb':6, 'cc':3,'dd':12}
x = {**d2 , **d1}
x

{'aa': 44,
 'bb': 6,
 'cc': 3,
 'dd': 12,
 'Arushi': 22,
 'Mani': 21,
 'Haritha': 21,
 'Leena': 32}

In [36]:
d1= {"Arushi": 22, "Mani": 21, "Haritha": 21,'Leena':32}
d2={'aa':44, 'bb':6, 'cc':3,'dd':12}
d1.update(d2)

In [37]:
d1

{'Arushi': 22,
 'Mani': 21,
 'Haritha': 21,
 'Leena': 32,
 'aa': 44,
 'bb': 6,
 'cc': 3,
 'dd': 12}

In [38]:
d1= {"Arushi": 22, "Mani": 21, "Haritha": 21,'Leena':32}
d2={'aa':44, 'bb':6, 'cc':3,'dd':12}
d2.update(d1)

In [39]:
d2

{'aa': 44,
 'bb': 6,
 'cc': 3,
 'dd': 12,
 'Arushi': 22,
 'Mani': 21,
 'Haritha': 21,
 'Leena': 32}

In [40]:
def calc(percent):
    if percent >= 90:
        return "A+"
    elif 80 <= percent < 90:
        return "A"
    elif 70 <= percent < 80:
        return "B"
    elif 60 <= percent < 70:
        return "C"
    elif 50 <= percent < 60:
        return "D"
    else:
        return "Fail"
def main():
    total_marks = 0 
    no_of_subjects = int(input("ENter the no of subjects:"))

    for i in range(no_of_subjects):
        marks = eval(input("Enter the marks of the subject:"))
        total_marks += marks

    average_percent = total_marks / no_of_subjects
    grade = calc(average_percent)
    print(f"Percentage recieved by the student is : {average_percent}")
    print(f"Grade recieved by Student is :{grade}")

if __name__ == "__main__":
    main()

Percentage recieved by the student is : 80.0
Grade recieved by Student is :A

In [41]:
def anagrams(words):
    anagram_dict = {}

    for word in words:
        sorted_word = " ".join(sorted(word))
        if sorted_word in anagram_dict:
            anagram_dict[sorted_word].append(word)
        else:
            anagram_dict[sorted_word] = [word]
        
    return anagram_dict.values()

def main():
    words = ["listen", "silent", "enlist", "hello", "world", "act", "cat", "dog", "god"]
    result = anagrams(words)

    print("Anagram groups:")
    for i in result:
        print(i)

if __name__ == "__main__":
    main()

Anagram groups:
['listen', 'silent', 'enlist']
['hello']
['world']
['act', 'cat']
['dog', 'god']

In [46]:
def anagrams(words):
    anagrams_dict = {}
    for i in words:
        sorted_word = " ".join(sorted(i))
        if sorted_word in anagrams_dict:
            anagrams_dict[sorted_word].append(i)
        else:
            anagrams_dict[sorted_word] = [i]
    
    return anagrams_dict.values()

def main():
    words = ["listen", "silent", "enlist", "hello", "world", "act", "cat", "dog", "god"]
    result = anagrams(words)

    print("Anagram groups:")
    for i in result:
        print(i)

if __name__ == "__main__":
    main()

Anagram groups:
['listen', 'silent', 'enlist']
['hello']
['world']
['act', 'cat']
['dog', 'god']

In [47]:
def anagrams(words):
    anagram_dict = {}
    for i in words:
        sorted_word = " ".join(sorted(i))
        if sorted_word in anagram_dict:
            anagram_dict[sorted_word].append(i)
        else:
            anagram_dict[sorted_word] = [i]
    return anagram_dict.values()

def main():
    words = ["listen", "silent", "enlist", "hello", "world", "act", "cat", "dog", "god"]

    result = anagrams(words)
    print("Anagram Groups:")
    for i in result:
        print(i)

if __name__ == "__main__":
    main()

Anagram Groups:
['listen', 'silent', 'enlist']
['hello']
['world']
['act', 'cat']
['dog', 'god']

In [48]:
def check(num1 , num2):
    binary_num1 = bin(num1)[2:]
    binary_num2 = bin(num2)[2:]

    return sorted(binary_num1) == sorted(binary_num2)
num1 = 10 
num2 = 20 
if check(num1 , num2):
    print(f"The Binary representation of {num1} and {num2} are anagrams.")
else:
    print(f"The Binary representation of {num1} and {num2} are not anagrams.")

The Binary representation of 10 and 20 are not anagrams.

In [49]:
def check(num1, num2):
    binary_num1 = bin(num1)[2:]
    binary_num2 = bin(num2)[2:]

    return sorted(binary_num1) == sorted(binary_num2)
num1 = 11
num2 = 22
if check(num1 , num2):
    print(f"The Binary representation of {num1} and {num2} are anagrams.")
else:
    print(f"The Binary representation of {num1} and {num2} are not anagrams")

The Binary representation of 11 and 22 are not anagrams

In [50]:
from collections import defaultdict
from collections import Counter
words = ["cat", "dog", "tac", "god", "act"]
anagram_groups = defaultdict(list)

for i in words:
    tuple_sorted = tuple(sorted((Counter(i).items())))
    anagram_groups[tuple_sorted].append(i)

max_size = max([len(i) for i in anagram_groups.values()])
max_anagram = [i for i in anagram_groups.values() if len(i) == max_size]


print("Size of the largest anagram subset:",max_size)
print("Largest anagram group(s):",max_anagram)

Size of the largest anagram subset: 3
Largest anagram group(s): [['cat', 'tac', 'act']]

In [51]:
from collections import defaultdict
from collections import Counter
words = ["cat", "dog", "tac", "god", "act"]

anagram_groups = defaultdict(list)

for i in words:
    tuple_sorted = tuple(sorted((Counter(i).items())))
    anagram_groups[tuple_sorted].append(i)

max_size = max([len(i) for i in anagram_groups.values()])
max_anagram = [i for i in anagram_groups.values() if len(i) == max_size]
print("Size of the largest anagram subset:",max_size)
print("Largest anagram group(s):",max_anagram)

Size of the largest anagram subset: 3
Largest anagram group(s): [['cat', 'tac', 'act']]

In [52]:
def count_freq(list1):
    freq = {}

    for i in list1:
        if i in freq:
            freq[i] += 1
        else:
            freq[i] = 1 
    for key,value in freq.items():
        print("%d : %d" % (key , value))

result = count_freq([1, 1, 1, 5, 5, 3, 1, 3, 3, 1,4, 4, 4, 2, 2, 2, 2])
result

1 : 5
5 : 2
3 : 3
4 : 3
2 : 4

In [54]:
def count_freq(list1):
    freq = {}
    for i in list1:
        if i in freq:
            freq[i] += 1
        else:
            freq[i] = 1
        
    for key,value in freq.items():
        print(f"{key} : {value}")
    
count_freq([1, 1, 1, 5, 5, 3, 1, 3, 3, 1,4, 4, 4, 2, 2, 2, 2])

1 : 5
5 : 2
3 : 3
4 : 3
2 : 4

In [55]:
tups = [("akash", 10), ("gaurav", 12), ("anand", 14), 
    ("suraj", 20), ("akhil", 25), ("ashish", 30)]
dict1 = {}

for key,value in tups:
    dict1[key] = value
print(dict1)

{'akash': 10, 'gaurav': 12, 'anand': 14, 'suraj': 20, 'akhil': 25, 'ashish': 30}

In [56]:
tups = [("akash", 10), ("gaurav", 12), ("anand", 14), 
    ("suraj", 20), ("akhil", 25), ("ashish", 30)]
dict1 = {}
for key,value in tups:
    dict1[key] = value
print(dict1)

{'akash': 10, 'gaurav': 12, 'anand': 14, 'suraj': 20, 'akhil': 25, 'ashish': 30}

In [57]:
numbers = [2, 3, 4, 5, 6]

tuple_list = [(num ,num ** 3) for num in numbers]

print("List of tuples: ", tuple_list)

List of tuples:  [(2, 8), (3, 27), (4, 64), (5, 125), (6, 216)]

In [59]:
numbers = [2, 3, 4, 5, 6]

tuple_list = [(num , num ** 3) for num in numbers]

print("List of tuples: ", tuple_list)

List of tuples:  [(2, 8), (3, 27), (4, 64), (5, 125), (6, 216)]

In [60]:
numbers = [2, 3, 4, 5, 6]

tuple_list = [(num ,num ** 3) for num in numbers]

print("List of tuples: ", tuple_list)

List of tuples:  [(2, 8), (3, 27), (4, 64), (5, 125), (6, 216)]

In [61]:
tuples_list = [(2, 8), (3, 27), (1, 1), (5, 125), (4, 64)]

result = sorted(tuples_list , key=lambda x : x[1])

result

[(1, 1), (2, 8), (3, 27), (4, 64), (5, 125)]

In [62]:
tuples_list = [(2, 8), (3, 27), (1, 1), (5, 125), (4, 64)]

result = sorted(tuples_list , key=lambda x : x[0])

result

[(1, 1), (2, 8), (3, 27), (4, 64), (5, 125)]

In [4]:
subject_marks = [("English",88) , ("Science",90) , ("Maths",97) , ("Social sciences",82)]
subject_marks.sort(key=lambda x : x[1])
subject_marks

[('Social sciences', 82), ('English', 88), ('Science', 90), ('Maths', 97)]

In [5]:
subject_marks = [("English",88) , ("Science",90) , ("Maths",97) , ("Social sciences",82)]
subject_marks.sort(key=lambda x : x[1])
subject_marks

[('Social sciences', 82), ('English', 88), ('Science', 90), ('Maths', 97)]

In [8]:
x = (lambda list1 : sorted(list1))([(10,5),(5,2),(1,8)])
x

[(1, 8), (5, 2), (10, 5)]

In [9]:
list1 = [{"name" : "Nandini" , "age" : 20} ,
        {"name" : "Manjeet" , "age" : 20} ,
        {"name" : "Nikhil" , "age" : 19}]
print(sorted(list1 , key=lambda x : x["age"]))

[{'name': 'Nikhil', 'age': 19}, {'name': 'Nandini', 'age': 20}, {'name': 'Manjeet', 'age': 20}]

In [10]:
print(sorted(list1, key=lambda x : x["name"]))

[{'name': 'Manjeet', 'age': 20}, {'name': 'Nandini', 'age': 20}, {'name': 'Nikhil', 'age': 19}]

In [11]:
print(sorted(list1 , key=lambda x : x["name"] ,reverse=True))

[{'name': 'Nikhil', 'age': 19}, {'name': 'Nandini', 'age': 20}, {'name': 'Manjeet', 'age': 20}]

In [12]:
input_numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
square = [(lambda x : x**2) (num) for num in input_numbers]
cube = [(lambda x : x**3) (num) for num in input_numbers]
square

[1, 4, 9, 16, 25, 36, 49, 64, 81, 100]

In [13]:
cube

[1, 8, 27, 64, 125, 216, 343, 512, 729, 1000]

In [14]:
square = (lambda list1 :[i**2 for i in list1])([1,2,3,4])
square

[1, 4, 9, 16]

In [15]:
cube = (lambda list1 : [i**3 for i in list1])([1,2,3,4])
cube

[1, 8, 27, 64]

In [16]:
result = lambda x : True if x.startswith("P") else False
result("Python")

True

In [17]:
result = lambda x : True if x.startswith("p") else False
result("Abhishek")

False

In [18]:
import re 
x = (lambda x : re.findall("^p",x))(x = "python")
x

['p']

In [19]:
import re 
x = (lambda x : re.findall("^p",x))(x = "python")
x

['p']

In [20]:
x = (lambda x : x.startswith("p"))(x = "python")
x

True

In [22]:
x = (lambda x : x.startswith("m"))(x = "mangesh")
x

True

In [1]:
x = (lambda string1 : string1.isdigit())(string1 = "1234")
x

True

In [2]:
x = (lambda string1 : string1.isdecimal())(string1 = "1234")
x

True

In [3]:
x = (lambda string1 : string1.isnumeric())(string1 = "1234")
x

True

In [5]:
import re
x = (lambda string1 : re.findall("[0-9]{1,}",string1))(string1 = "1234")
x

['1234']

In [6]:
from functools import reduce
result = lambda n : reduce(lambda x ,_:x+[x[-1]+x[-2]] , range(n-2),[0,1])
result(10)

[0, 1, 1, 2, 3, 5, 8, 13, 21, 34]

In [7]:
n = 9 
f1 = 0 
f2 = 1 
print(f1,f2,end=" ")
for i in range(2,n):
    f3 = f1 + f2 
    f1,f2 = f2,f3
    print(f3 , end=" ")

0 1 1 2 3 5 8 13 21

In [8]:
n = 10 
f1 = 0
f2 = 1 
print(f1 , f2 ,end=" ")
for i in range(2,n):
    f3 = f1 + f2
    f1,f2 = f2,f3
    print(f3 , end=" ")

0 1 1 2 3 5 8 13 21 34

In [9]:
n = 12
f1 = 0 
f2 = 1 
print(f1,f2,end=" ")
for i in range(2,n):
    f3 = f1 + f2
    f1,f2 = f2,f3
    print(f3 , end=" ")

0 1 1 2 3 5 8 13 21 34 55 89

In [10]:
array_nums1 = [1,2,3,5,7,8,9,10]
array_nums2 = [1,2,4,8,9]
result = (lambda array_nums1,array_nums2 : list(filter(lambda x : x in array_nums1,array_nums2)))
result

In [11]:
list1 = [1,2,3,4]
list2 = [3,4,5,6]
x = list(filter(lambda x : x in list1,list2))
x

[3, 4]

In [13]:
list1 = [1,2,3,4]
list2 = [3,4,5,6]
x = list(filter(lambda x : x in list1,list2))
x

[3, 4]

In [14]:
list1 = [1,2,3,4]
list2 = [3,4,5,6]
x = list(filter(lambda x : x in list1 , list2))
x

[3, 4]

In [15]:
list1 = [-1,2,-3,5,7,8,9,-10]
result = (lambda list1 : [x for x in list1 if x>=0] + [x for x in list1 if x <0])
final = result(list1)
final

[2, 5, 7, 8, 9, -1, -3, -10]

In [16]:
list1 = [-1,2,-3,5,7,8,9,-10]
result = (lambda list1 : [x for x in list1 if x<0] + [x for x in list1 if x >= 0])
final = result(list1)
final

[-1, -3, -10, 2, 5, 7, 8, 9]

In [17]:
array_nums = [1,2,3,5,7,8,9,10]
odd_counter = len(list(filter(lambda x : (x%2!=0),array_nums)))
even_counter = len(list(filter(lambda x : (x%2==0),array_nums)))
odd_counter

5

In [18]:
even_counter

3

In [19]:
array_nums = [1,2,3,5,7,8,9,10,11,12,13,43,54,35]
odd_counter = len(list(filter(lambda x : (x%2!=0) , array_nums)))
even_counter = len(list(filter(lambda x : (x%2==0),array_nums)))
odd_counter

9

In [20]:
even_counter

5

In [21]:
list1 = [1,2,3]
list2 = [4,5,6]
result = map(lambda x1,x2 : x1+x2 , list1,list2)
list(result)

[5, 7, 9]

In [22]:
list1 = [1,2,3,4,5]
list2 = [4,5,6,7,8]
result = list(map(lambda x1,x2 : x1+x2 , list1,list2))
result

[5, 7, 9, 11, 13]

In [23]:
result = list(map(lambda x1,x2 : x1*x2 , list1,list2))
result

[4, 10, 18, 28, 40]

In [24]:
result = list(map(lambda x1,x2 : x1-x2,list1,list2))
result

[-3, -3, -3, -3, -3]

In [25]:
list1 = [13,26,38,39,57,15,17]
x = list(filter(lambda x : (x%13==0 or x%19==0),list1))
x

[13, 26, 38, 39, 57]

In [26]:
list1 = [13,26,38,39,57,15,17,3,2,24]
x = list(map(lambda x : x/2 , list1))
x

[6.5, 13.0, 19.0, 19.5, 28.5, 7.5, 8.5, 1.5, 1.0, 12.0]

In [27]:
texts = ["php" , "w3r" , "Python" , "abcd" ,"Java" , "aaa"]
result = list(filter(lambda x : (x=="".join(reversed(x))),texts))
result

['php', 'aaa']

In [28]:
texts = ["php" , "w3r" , "Python" , "abcd" ,"Java" , "aaa"]
result = list(filter(lambda x : (x=="".join(reversed(x))),texts))
result

['php', 'aaa']

In [29]:
texts = ["bcda","abce","cbda","cbea","adcb"]
from collections import Counter
str1 = "abcd"
result = list(filter(lambda x : (Counter(str1)==Counter(x)),texts))
result

['bcda', 'cbda', 'adcb']

In [30]:
texts = ["bcda","abce","cbda","cbea","adcb"]
from collections import Counter
str1 = "abcd"
result = list(filter(lambda x : (Counter(str1)==Counter(x)),texts))
result

['bcda', 'cbda', 'adcb']

In [31]:
texts = ["bcda","abce","cbda","cbea","adcb"]
from collections import Counter
str1 = "abcd"
result = list(filter(lambda x : (Counter(str1)==Counter(x)),texts))
result

['bcda', 'cbda', 'adcb']

In [32]:
list1 = [2,3,4,5]
result = list(map(lambda x : x*5 , list1))
result

[10, 15, 20, 25]

In [33]:
list1 = [-1,-2,3,4]
positive = list(filter(lambda x : x>0,list1))
negative = list(filter(lambda x : x<0,list1))
positive

[3, 4]

In [34]:
negative

[-1, -2]

In [36]:
list1 = [[0],[1,3],[5,7],[9,11],[13,15,17]]
result = max(list(filter(lambda x : len(x),list1)))
result

[13, 15, 17]

In [37]:
list1 = [[0],[1,3],[5,7],[9,11],[13,15,17]]
result = min(list(filter(lambda x : len(x),list1)))
result

[0]

In [38]:
result = max(list(filter(lambda x : len(x),list1)))
result

[13, 15, 17]

In [43]:
sample_list_1 = [1, 2, 3, 4, 5]
sample_list_2 = [5, 3, 1, 4, 2]
result = (lambda sample_list_1 : sample_list_1 == sorted(sample_list_1))
result(sample_list_1)

True

In [46]:
sample_list_1 = [1, 2, 3, 4, 5]
sample_list_2 = [5, 3, 1, 4, 2]
result = (lambda sample_list_2 : sample_list_2 == sorted(sample_list_2))
result(sample_list_2)

False

In [48]:
list1 = [1,2,3,4,5,6,7,8,9,10]
list2 = [2,4,6,8]
result = list(filter(lambda x : x not in list2,list1))
result

[1, 3, 5, 7, 9, 10]

In [49]:
list1 = [1,2,3,4,5,6,7,8,9,10]
list2 = [2,4,6,8]
result = list(filter(lambda x : x not in list1,list2))
result

[]

In [51]:
tuple_str = (("223","ABCD","33") , ("1416","EFGH","55") , ("2345","WERT","34"))
result = tuple(map(lambda x : (int(x[0]),int(x[2])),tuple_str))
result

((223, 33), (1416, 55), (2345, 34))

In [52]:
tuple_str = (("223","ABCD","33") , ("1416","EFGH","55") , ("2345","WERT","34"))
result = tuple(map(lambda x : (int(x[0]),int(x[2])),tuple_str))
result

((223, 33), (1416, 55), (2345, 34))

In [53]:
nums = [3,4,5,8,0,3,8,5,0,3,1,5,2,3,4,2]
result = dict(map(lambda x : (x ,list(nums).count(x)),nums))
result

{3: 4, 4: 2, 5: 3, 8: 2, 0: 2, 1: 1, 2: 2}

In [54]:
nums = [3,4,5,8,0,3,8,5,0,3,1,5,2,3,4,2]
result = dict(map(lambda x : (x,list(nums).count(x)),nums))
result

{3: 4, 4: 2, 5: 3, 8: 2, 0: 2, 1: 1, 2: 2}

In [55]:
nums = [3,4,5,8,0,3,8,5,0,3,1,5,2,3,4,2]
result = dict(map(lambda x : (x,list(nums).count(x)),nums))
result

{3: 4, 4: 2, 5: 3, 8: 2, 0: 2, 1: 1, 2: 2}

In [58]:
l1 = [1,2,3]
l2 = [4,5,6]
l3 = [7,8,9]
result = list(map(lambda x1,x2,x3 : x1+x2+x3,l1,l2,l3))
result

[12, 15, 18]

In [57]:
l1 = [1,2,3]
l2 = [4,5,6]
l3 = [7,8,9]
result = list(map(lambda x1,x2,x3 : x1+x2+x3,l1,l2,l3))
result

[12, 15, 18]

In [59]:
l1 = ["yellow","blue","tricolor"]
x = list(map(list,l1))
x

[['y', 'e', 'l', 'l', 'o', 'w'],
 ['b', 'l', 'u', 'e'],
 ['t', 'r', 'i', 'c', 'o', 'l', 'o', 'r']]

In [60]:
l1 = ["yellow","blue","tricolor"]
x = list(map(list,l1))
x

[['y', 'e', 'l', 'l', 'o', 'w'],
 ['b', 'l', 'u', 'e'],
 ['t', 'r', 'i', 'c', 'o', 'l', 'o', 'r']]

In [61]:
l1 = [12,15,18]
result = list(map(lambda x : x**2,l1))
result

[144, 225, 324]

In [62]:
l1 = [12,15,18]
result = list(map(lambda x : x**3,l1))
result

[1728, 3375, 5832]

In [63]:
list1 = [1, 2, 3, 4, 5]
list2 = [5, 4, 3, 2, 1]
result = list(map(lambda x1,x2 : x1+x2,list1,list2))
result

[6, 6, 6, 6, 6]

In [64]:
result = list(map(lambda x1,x2 : x1-x2,list1,list2))
result

[-4, -2, 0, 2, 4]

In [65]:
# Given list of integers
int_list = [1, 2, 3, 4, 5]

# Given tuple of integers
int_tuple = (6, 7, 8, 9, 10)

str_list = list(map(lambda x : str(x),int_list))
str_tuple = tuple(map(lambda x : str(x),int_tuple))
str_list

['1', '2', '3', '4', '5']

In [66]:
str_tuple

('6', '7', '8', '9', '10')

In [67]:
num_array = [1, 2, 3, 4, 5]
result = sum(map(lambda x : x,num_array))
result

15

In [68]:
num_array = [1, 2, 3, 4, 5]
result = sum(map(lambda x : x,num_array))
result

15

In [69]:
list1 = [1, 2, 3, 4, 5]
list2 = [1, 2, 4, 8, 9]
result = sum(map(lambda x,y : x == y,list1,list2))
result

2

In [70]:
list1 = [1, 2, 3, 4, 5]
list2 = [1, 2, 4, 8, 9]
result = sum(map(lambda x,y : x == y,list1,list2))
result

2

In [71]:
str1 = ["python","machine","learning"]
result = list(map(list,str1))
result

[['p', 'y', 't', 'h', 'o', 'n'],
 ['m', 'a', 'c', 'h', 'i', 'n', 'e'],
 ['l', 'e', 'a', 'r', 'n', 'i', 'n', 'g']]

In [72]:
str1 = ["python","machine","learning"]
result = list(map(list,str1))
result

[['p', 'y', 't', 'h', 'o', 'n'],
 ['m', 'a', 'c', 'h', 'i', 'n', 'e'],
 ['l', 'e', 'a', 'r', 'n', 'i', 'n', 'g']]

In [74]:
list_tup = [("python","machine"),("learning","data science")]
result = list(map(" ".join,list_tup))
result

['python machine', 'learning data science']

In [75]:
list_tup = [("python","machine"),("learning","data science")]
result = list(map(" ".join,list_tup))
result

['python machine', 'learning data science']

In [76]:
list_tup = [("python","machine"),("learning","data science")]
result = list(map(" ".join,list_tup))
result

['python machine', 'learning data science']

In [78]:
l1 = [1,2,3]
l2 = [1,2,4,5,6]
result = list(filter(lambda x : x not in l1,l2))
result

[4, 5, 6]

In [80]:
from nltk.corpus import stopwords
stopword_list = stopwords.words("english")
string = "Hi where are you going to sleep"
result = filter(lambda x : x.lower() not in stopword_list,string)
final = " ".join(result)
final

'H   w h e r e   r e   u   g n g     l e e p'

In [81]:
from nltk.corpus import stopwords
stopword_list = stopwords.words("english")
string = "Hi where are you going to sleep"
result = filter(lambda x : x.lower() not in stopword_list,string)
final = " ".join(result)
final

'H   w h e r e   r e   u   g n g     l e e p'

In [83]:
from nltk.corpus import stopwords
stopword_list = stopwords.words("english")
string = "Hi where are you going to sleep"
result = filter(lambda x : x.lower() not in stopword_list,string)
final = " ".join(result)
final

'H   w h e r e   r e   u   g n g     l e e p'

In [85]:
l1 = [1,2,3]
l2 = [1,2,4,5,6]
result = list(filter(lambda x : x in l1,l2))
result

[1, 2]

In [86]:
l1 = [1,2,3]
l2 = [1,2,4,5,6]
result = list(filter(lambda x : x in l2,l1))
result

[1, 2]

In [87]:
l1 = [1,2,3]
result = list(filter(lambda x : x%2!=0,l1))
result

[1, 3]

In [88]:
l1 = [1,2,3]
result = list(filter(lambda x : x%2==0,l1))
result

[2]